Repository: oae/gnome-shell-pano
Catalog: resources/po/*.po
Languages: ar, bg, cs, da, de, el, es, et, fi, fr, he, is, it, ko, no, oc, pl, pt, pt_br, ro, ru, sk, sv, tr, uk, vi, zh_cn, zh_tw

source: Wiggle Indicator
cs: Indikátor kmitání
de: Wackelindikator
es: Agitar el indicador
fr: Oscillation de l’indicateur
ko: 표시기 흔들기
pt_br: Agitar Indicador
ru: Покачивающийся индикатор
tr: Göstergeyi Oynat
uk: Коливання індикатора
zh_cn: 抖动指示器
zh_tw: 振動圖示

source: Wiggles the indicator on panel
cs: Rozhýbe indikátor na panelu
de: Wackelt mit dem Indikator auf dem Bedienfeld
es: Agita el indicador en el panel
fr: Fait bouger l’indicateur sur le panneau
ko: 패널의 표시기를 흔들기
pt_br: Agita o indicador na barra
ru: Покачивающийся индикатор на панели
tr: Paneldeki göstergeyi oynatır
uk: Коливає індикатор на панелі
zh_cn: 抖动面板上的程序指示器
zh_tw: 在頂欄中振動圖示

source: Image Copied
cs: Obrázek zkopírován
de: Bild kopiert
es: Imagen copiada
fr: Image copiée
it: Immagine copiata
ko: 이미지 복사됨
pt_br: Imagem Copiada
ru: Изображение скопировано
tr: Resim Kopyalandı
uk: Зображення скопійовано
zh_cn: 图像已复制
zh_tw: 已複製圖片

source: Width: %spx, Height: %spx, Size: %s
cs: Šířka: %spx, Výška: %spx, Velikost: %s
de: Breite: %spx, Höhe: %spx, Größe: %s
es: Anchura: %spx, Altura: %spx, Tamaño: %s
fr: Largeur : %spx, Hauteur : %spx, Taille : %s
it: Larghezza: %spx, Altezza: %spx, Dimensione: %s
ko: 너비: %spx, 높이: %spx, 크기: %s
pt_br: Largura: %spx, Altura: %spx, Tamanho: %s
ru: Ширина: %spx, Высота: %spx, Размер: %s
tr: Genişlik: %spx, Yükseklik: %spx, Boyut: %s
uk: Ширина: %spx, Висота: %spx, Розмір: %s
zh_cn: 宽：%spx，高：%spx，尺寸：%s
zh_tw: 寬度：%s個像素，高度：%s個像素，大小：%s

source: Text Copied
cs: Text zkopírován
de: Text kopiert
es: Texto copiado
fr: Texte copié
it: Testo copiato
ko: 텍스트 복사됨
pt_br: Texto Copiado
ru: Текст скопирован
tr: Yazı Kopyalandı
uk: Текст скопійовано
zh_cn: 文本已复制
zh_tw: 已複製文字

source: Code Copied
cs: Kód zkopírován
de: Code kopiert
es: Código copiado
fr: Code copié
it: Codice copiato
ko: 코드 복사됨
pt_br: Código Copiado
ru: Код скопирован
tr: Kod Kopyalandı
uk: Код скопійовано
zh_cn: 代码已复制
zh_tw: 已複製程式碼

source: Emoji Copied
cs: Emoji zkopírováno
de: Emoji kopiert
es: Emoji copiado
fr: Émoji copié
it: Emoji Copiata
ko: 이모티콘 복사됨
pt_br: Emoji Copiado
ru: Эмодзи скопирован
tr: İfade Kopyalandı
uk: Емодзі скопійовано
zh_cn: 表情符号已复制
zh_tw: 已複製表情符號

source: Link Copied
cs: Odkaz zkopírován
de: Link kopiert
es: Enlace copiado
fr: Lien copié
it: Link copiato
ko: 링크 복사됨
pt_br: Link Copiado
ru: Ссылка скопирована
tr: Bağlantı Kopyalandı
uk: Посилання скопійовано
zh_cn: 链接已复制
zh_tw: 已複製連結

source: Color Copied
cs: Barva zkopírována
de: Farbe kopiert
es: Color copiado
fr: Couleur copiée
it: Colore copiato
ko: 색상 복사됨
pt_br: Cor Copiada
ru: Цвет скопирован
tr: Renk Kopyalandı
uk: Колір скопійовано
zh_cn: 颜色已复制
zh_tw: 已複製顏色

source: File %s
cs: Soubor %s
de: Datei %s
es: Archivo %s
fr: Fichier %s
ko: 파일 %s
pt_br: Arquivo %s
ru: Файл %s
tr: Dosya %s
uk: Файл %s
zh_cn: 文件%s
zh_tw: 檔案 %s

source: There are %s file(s)
cs: Existuje %s souborů
de: Es sind %s Datei(en)
es: Hay %s archivo(s)
fr: Il y a %s fichier(s)
it: Ci sono %s file(s)
ko: %s 개의 파일이 있음
pt_br: Existem %s arquivo(s)
ru: Есть %s файлов
tr: %s kadar dosya var
uk: Існує %s файл(ів)
zh_cn: %s个文件
zh_tw: 這裡有 %s 個檔案

source: Text
es: Texto
fr: Texte
it: Testo
ko: 텍스트
pt_br: Texto
ru: Текст
tr: Yazı
uk: Текст
zh_cn: 文本
zh_tw: 文字

source: File
cs: Soubor
de: Datei
es: Archivo
fr: Fichier
ko: 파일
pt_br: Arquivo
ru: Файл
tr: Dosya
uk: Файл
zh_cn: 文件
zh_tw: 檔案

source: Image
cs: Obrázek
de: Bild
es: Imagen
it: Immagine
ko: 이미지
pt_br: Imagem
ru: Изображение
tr: Resim
uk: Зображення
zh_cn: 图像
zh_tw: 圖片

source: Code
cs: Kód
es: Código
it: Codice
ko: 코드
pt_br: Código
ru: Код
tr: Kod
uk: Код
zh_cn: 代码
zh_tw: 程式碼

source: Color
cs: Barva
de: Farbe
fr: Couleur
it: Colore
ko: 색상
pt_br: Cor
ru: Цвет
tr: Renk
uk: Колір
zh_cn: 颜色
zh_tw: 顏色

source: Link
cs: Odkaz
es: Enlace
fr: Lien
ko: 링크
ru: Ссылка
tr: Bağlantı
uk: Посилання
zh_cn: 链接
zh_tw: 連結

source: Emoji
fr: Émoji
ko: 이모티콘
ru: Эмодзи
tr: İfade
uk: Емодзі
zh_cn: 表情符号
zh_tw: 表情符號

source: Type to search
da: Skriv for at søge
el: Πληκτρολογήστε για αναζήτηση
et: Sisestage otsimiseks
fi: Kirjoita etsiäksesi
he: הקלד כדי לחפש
no: Skriv for å søke
oc: Picatz per recercar
pl: Pisz by wyszukać
pt: Digite para pesquisar
