Repository: oae/gnome-shell-pano
Catalog: resources/po/*.po
Languages: ar, bg, cs, da, de, el, es, et, fi, fr, he, is, it, ko, no, oc, pl, pt, pt_br, ro, ru, sk, sv, tr, uk, vi, zh_cn, zh_tw

source: Customization
cs: Přizpůsobení
de: Anpassung
es: Personalización
fr: Personnalisation
it: Personalizzazione
ko: 개인화
pt_br: Customização
ru: Настройка
tr: Özelleştirme
uk: Персоналізація
zh_cn: 自定义
zh_tw: 個人化

source: Item Style
cs: Styly položky
de: Stil Eintrag
es: Estilo de las notas
fr: Style de l’élément
it: Stile elemento
ko: 항목 스타일
pt_br: Estilo do item
ru: Стиль элемента
tr: Öğe Tarzı
uk: Стиль елемента
zh_cn: 项目风格
zh_tw: 物件風格

source: Change the style of the link item
cs: Změňte styly odkazu
de: Ändern des Stils des Link-Eintrags
es: Cambia el estilo de las notas de enlaces
fr: Changer le style de l’élément de lien
it: Modificare lo stile dell'elemento di collegamento
ko: 링크 항목의 스타일을 바꾸기
pt_br: Mudar o estilo do item de link
ru: Изменить стиль элемента со сслыкой
tr: Bağlantı öğesinin tarzını değiştir
uk: Змінити стиль елемента посилання
zh_cn: 修改链接项目风格
zh_tw: 切換連結物件主題

source: Link Item Style
cs: Odkaz - nastavení stylů
de: Stil Link-Eintrag
es: Estilo de las notas de enlaces
fr: Style de l’élément de lien
it: Stile elemento di collegamento
ko: 링크 항목 스타일
pt_br: Estilo de Item de Link
ru: Стиль элемента со ссылкой
tr: Bağlantı Öğe Tarzı
uk: Стиль елемента посилання
zh_cn: 链接项目风格
zh_tw: 連結物件風格

source: Metadata Title Color
cs: Barva názvu metadat
de: Metadaten Titelfarbe
es: Color del título de los enlaces
fr: Couleur du titre des métadonnées
it: Colore del titolo dei metadati
ko: 메타데이터 제목 색상
pt_br: Cor do título do metadado
ru: Цвет заголовка метаданных
tr: Metaveri Başlık Rengi
uk: Колір заголовка метаданих
zh_cn: 元数据标题颜色
zh_tw: 詮釋資料標題顏色

source: You can change the title color of the metadata
cs: Můžete změnit barvu názvu metadat
de: Sie können die Titelfarbe der Metadaten ändern
es: Puedes cambiar el color del título de los enlaces
fr: Vous pouvez modifier la couleur du titre des métadonnées
it: Puoi cambiare il colore del titolo dei metadati
ko: 메타데이터 제목의 색상을 바꾸기
pt_br: Você pode mudar a cor do título do metadado
ru: Вы можете изменить цвет заголовка метаданных
tr: Metaverinin başlık rengini değiştirebilirsiniz
uk: Ви можете змінити колір заголовка метаданих
zh_cn: 修改元数据标题颜色
zh_tw: 你可以更換詮釋資料的標題顏色

source: Metadata Title Font
cs: Písmo názvu metadat
de: Metadaten Titel Schriftart
es: Tipo de letra del título de los enlaces
fr: Police du titre des métadonnées
it: Carattere del titolo dei metadati
ko: 메타데이터 제목 글꼴
pt_br: Fonte do título do metadado
ru: Шрифт заголовка метаданных
tr: Metaveri Başlık Yazı Tipi
uk: Шрифт заголовка метаданих
zh_cn: 元数据标题字体
zh_tw: 詮釋資料標題字體

source: You can change the font of the metadata title
cs: Můžete změnit písmo názvu metadat
de: Sie können die Schriftart des Metadatentitels ändern
es: Puedes cambiar la tipografía del título de los enlaces
fr: Vous pouvez modifier la police du titre des métadonnées
it: È possibile modificare il carattere del titolo dei metadati
ko: 메타데이터 제목의 글꼴을 바꾸기
pt_br: Você pode mudar a fonte do título do metadado
ru: Вы можете изменить шрифт заголовка метаданных
tr: Metaverinin başlığının yazı tipini değiştirebilirsiniz
uk: Ви можете змінити шрифт заголовка метаданих
zh_cn: 修改元数据标题字体
zh_tw: 你可以更換詮釋資料標題的字體

source: Metadata Description Color
cs: Barva popisu metadat
de: Metadaten Beschreibungsfarbe
es: Color de la descripción del enlace
fr: Couleur de la description des métadonnées
it: Descrizione Colore Metadati
ko: 메타데이터 설명 색상
pt_br: Cor da descrição do metadado
ru: Цвет описания ссылки
tr: Metaveri Açıklama Rengi
uk: Колір опису метаданих
zh_cn: 元数据详情颜色
zh_tw: 詮釋資料說明顏色

source: You can change the description color of the metadata
cs: Můžete změnit barvu popisu metadat
de: Sie können die Beschreibungsfarbe der Metadaten ändern
es: Puedes cambiar el color de la descripción del enlace
fr: Vous pouvez modifier la couleur de description des métadonnées
it: Puoi cambiare il colore della descrizione dei metadati
ko: 메타데이터 설명의 색상을 바꾸기
pt_br: Você pode mudar a cor da descrição do metadado
ru: Вы можете изменить цвет текста описания метаданных
tr: Metaverinin açıklama rengini değiştirebilirsiniz
uk: Ви можете змінити колір опису метаданих
zh_cn: 修改元数据详情颜色
zh_tw: 你可以更換詮釋資料的說明顏色

source: Metadata Description Font
cs: Písmo popisu metadat
de: Metadaten Beschreibung Schriftart
es: Tipo de letra de la descripción del enlace
fr: Police de description des métadonnées
it: Descrizione Carattere Metadati
ko: 메타데이터 설명 글꼴
pt_br: Fonte da descrição do metadado
ru: Шрифт описания ссылки
tr: Metaveri Açıklama Yazı Tipi
uk: Шрифт опису метаданих
zh_cn: 元数据详情字体
zh_tw: 詮釋資料說明字體

source: You can change the font of the metadata description
cs: Můžete změnit písmo popisu metadat
de: Sie können die Schriftart der Metadatenbeschreibung ändern
es: Puedes cambiar el tipo de letra de la descripción del enlace
fr: Vous pouvez modifier la police de description des métadonnées
it: È possibile modificare il carattere della descrizione dei metadati
ko: 메타데이터 설명의 글꼴을 바꾸기
pt_br: Você pode mudar a fonte da descrição do metadado
ru: Вы можете изменить шрифт описания ссылки
tr: Metaverinin açıklama yazı tipini değiştirebilirsiniz
uk: Ви можете змінити шрифт опису метаданих
zh_cn: 修改元数据详情字体
zh_tw: 你可以更換詮釋資料說明的字體

source: Metadata Link Color
cs: Barva odkazu metadat
de: Metadaten Linkfarbe
es: Color del enlace
fr: Couleur du lien des métadonnées
it: Colore del collegamento ai metadati
ko: 메타데이터 링크 색상
pt_br: Cor do link do metadado
ru: Цвет элемента со ссылкой
tr: Metaveri Bağlantı Rengi
uk: Колір посилання метаданих
zh_cn: 元数据链接颜色
zh_tw: 詮釋資料連結顏色

source: You can change the link color of the metadata
cs: Můžete změnit barvu odkazu metadat
de: Sie können die Linkfarbe der Metadaten ändern
es: Puedes cambiar el color del enlace
fr: Vous pouvez modifier la couleur du lien des métadonnées
it: È possibile modificare il colore del collegamento dei metadati
ko: 메타데이터 링크의 색상을 바꾸기
pt_br: Você pode mudar a cor do link do metadado
ru: Вы можете изменить цвет ссылки метаданных
tr: Metaverinin bağlantı rengini değiştirebilirsiniz
uk: Ви можете змінити колір посилання метаданих
zh_cn: 修改元数据链接颜色
zh_tw: 你可以更換詮釋資料的連結顏色

source: Metadata Link Font
cs: Písmo odkazu metadat
de: Metadaten Link Schriftart
es: Tipo de letra del enlace
fr: Police du lien des métadonnées
it: Carattere di collegamento metadati
ko: 메타데이터 링크 글꼴
pt_br: Fonte do link do metadado
ru: Шрифт сслыки
tr: Metaveri Bağlantı Yazı Tipi
uk: Шрифт посилання метаданих
zh_cn: 元数据链接字体
zh_tw: 詮釋資料連結字體

source: You can change the font of the metadata link
cs: Můžete změnit písmo odkazu na metadata
de: Sie können die Schriftart des Metadatenlinks ändern
es: Puedes cambiar la tipografía de los enlaces
fr: Vous pouvez modifier la police du lien des métadonnées
it: È possibile modificare il carattere del collegamento ai metadati
ko: 메타데이터 링크의 글꼴을 바꾸기
pt_br: Você pode mudar a fonte do link do metadado
ru: Вы можете изменить шрифт ссылки
tr: Metaverinin bağlantı yazı tipini değiştirebilirsiniz
uk: Ви можете змінити шрифт посилання метаданих
zh_cn: 修改元数据链接字体
zh_tw: 你可以更換詮釋資料連結的字體

source: Change the style of the text item
cs: Změňte styly textu
de: Ändern des Stils des Text-Eintrags
es: Cambia el estilo de las notas de texto
fr: Changer le style de l’élément de texte
it: Cambia lo stile dell'elemento di testo
ko: 텍스트 항목의 스타일을 바꾸기
pt_br: Mude o estilo do item de texto
ru: Изменить стиль элемента с текстом
tr: Yazı öğesinin tarzını değiştirebilirsiniz
uk: Змінити стиль текстового елемента
zh_cn: 修改文本项目风格
zh_tw: 切換文字物件主題

source: Text Item Style
cs: Text - nastavení stylů
de: Stil Text-Eintrag
es: Estilo de las notas de texto
fr: Style de l’élément de texte
it: Stile elemento di testo
ko: 텍스트 항목 스타일
pt_br: Estilo de item de texto
ru: Стиль элемента с текстом
tr: Yazı Öğe Tarzı
uk: Стиль текстового елемента
zh_cn: 文本项目风格
zh_tw: 文字物件風格

source: Clears the clipboard database and cache
ar: يزيل قاعدة بيانات الحافظة وذاكرتها المؤقتة
bg: Изчиства базата данни и кеша на клипборда
cs: Vymaže databázi schránky a mezipaměť
da: Rydder udklipsholderens database og cache
de: Leert die Zwischenablage-Datenbank und den Cache
el: Διαγράφει τη βάση δεδομένων και τη μνήμη cache του προχείρου
es: Borra la base de datos y la caché del portapapeles
et: Tühjendab lõikelaua andmebaasi ja vahemälu
fi: Tyhjentää leikepöydän tietokannan ja välimuistin
fr: Vider la base de données du presse-papiers et le cache
he: מנקה את מסד הנתונים והמטמון של הלוח
is: Hreinsar klippispjaldsgagnagrunninn og skyndiminnið
it: Cancella il database degli Appunti e la cache
ko: 클립보드 데이터베이스 및 캐시를 삭제
no: Tømmer utklippstavledatabasen og hurtigbufferen
oc: Escafa la basa de donadas del quichapapièrs e lo cache
pl: Czyści schowek i pamięć podręczną
pt: Limpa o banco de dados e o cache da área de transferência
pt_br: Limpa o banco de dados da área de transferência e o cache
ro: Golește baza de date clipboard și memoria cache
ru: Очистить базу данных буфера обмена и кэш
sk: Vymaže databázu schránky a vyrovnávaciu pamäť
sv: Rensar urklippsdatabasen och cacheminnet
tr: Pano veritabanını ve önbelleği temizler
uk: Очищає базу даних і кеш буфера обміну
vi: Xóa dữ liệu khay nhớ tạm và dữ liệu tạm thời
zh_cn: 清除剪贴板数据库和缓存
zh_tw: 清除剪貼簿資料庫和快取

source: Danger Zone
ar: منطقة الخطر
bg: Опасна зона
cs: Pokročilé
da: Farezone
de: Gefahrenbereich
el: Επικίνδυνη Ζώνη
es: Zona de peligro
et: Ohuala
fi: Vaaravyöhyke
fr: Zone à risque
he: אזור הסכנה
is: Hættusvæði
it: Zona di pericolo
ko: 위험 구역
no: Faresone
oc: Zòna perilhosa
pl: Strefa Niebezpieczeństwa
pt: Zona de Perigo
pt_br: Zona de perigo
ro: Zona periculoasă
ru: Зона опасности
sk: Nebezpečná zóna
sv: Riskområde
tr: Tehlikeli bölge
uk: Небезпечна зона
vi: Khu Vực Nguy Hiểm
zh_cn: 危险操作
zh_tw: 危險區域

source: Session Only Mode
ar: وضع الجلسة المنعزلة
bg: Режим само за сесия
cs: Režim: Pouze relace
da: Kun sessionstilstand
de: Einzelsession-Modus
el: Λειτουργία μόνο περιόδου λειτουργίας
es: Funcionar solo durante la sesión
et: Ainult seansi režiim
fi: Vain istunto -tila
fr: Mode session unique
he: מצב הפעלה בלבד
is: Setuhamur eingöngu
it: Modalità solo sessione
ko: 세션 전용 모드
no: Bare økt-modus
oc: Mòde session solament
pl: Tryb Sesyjny
pt: Modo Somente Sessão
pt_br: Modo somente de sessão
ro: Modul numai sesiune
ru: Режим работы в рамках сеанса
sk: Režim iba relácie
sv: Endast sessionsläge
tr: Sadece Oturum Modu
uk: Режим лише сеансу
vi: Chế Độ Tạm Thời
zh_cn: 仅会话模式
zh_tw: 僅「記憶體」模式

source: When enabled, Pano will clear all history on logout/restart/shutdown.
ar: تمكين هذا الخيار يجعل بانو يمحو التاريخ عند الخروج من الجلسة أو إعادة التشغيل
bg: Когато е активиран, Pano ще изчисти цялата история при излизане / рестартиране / изключване.
cs: Pokud je tato možnost povolena, Pano vymaže celou historii při odhlášení/restartu/vypnutí.
da: Når den er aktiveret, rydder Pano al historik ved logout / genstart / nedlukning.
de: Wenn aktiviert, wird Pano die Historie leeren beim Ausloggen/Neustarten/Herunterfahren.
el: Όταν ενεργοποιηθεί, το Pano θα διαγράψει όλο το ιστορικό αποσύνδεσης / επανεκκίνησης / τερματισμού λειτουργίας.
es: Cuando está habilitado Pano borra todo el historial al cerrar sesión, reiniciar o apagar el equipo.
et: Kui see on lubatud, kustutab Pano kogu ajaloo väljalogimisel/taaskäivitamisel/seiskamisel.
fi: Kun tämä on käytössä, Pano tyhjentää kaiken historian uloskirjautumisen/uudelleenkäynnistyksen/sammutuksen yhteydessä.
fr: Lorsque ce mode est activé, Pano va automatiquement vider l’historique lors de la déconnexion / redémarrage / extinction.
he: כאשר אפשרות זו מופעלת, Pano תנקה את כל ההיסטוריה בעת התנתקות/הפעלה מחדש/כיבוי.
is: Þegar þetta er virkt mun Pano hreinsa allan feril við útskráningu/endurræsingu/lokun.
it: Quando abilitato, Pano cancellerà tutta la cronologia su logout / riavvio / spegnimento.
ko: 활성화되면 Pano는 로그아웃/재시작/종료 시 모든 기록을 지웁니다.
no: Når den er aktivert, vil Pano slette all historikk ved utlogging / omstart / avslutning.
pl: Gdy włączony, Pano wyczyści całą historię podczas wylogowania/restartu/wyłączenia komputera.
pt: Quando ativado, o Pano limpará todo o histórico ao fazer logout/reiniciar/desligar.
pt_br: Quando ativado, o Pano limpará todo o histórico no logout/reinício/desligamento.
ro: Când este activată, Pano va șterge tot istoricul privind deconectarea/repornirea/închiderea.
ru: Когда включено, Pano будет очищать всю историю при выходе/перезапуске/выключении.
sk: Keď je zapnutá, Pano vymaže celú históriu pri odhlásení/reštartovaní/vypnutí.
sv: När den är aktiverad rensar Pano all historik vid utloggning/omstart/avstängning.
tr: Etkinleştirildiğinde, Pano oturum kapatma/yeniden başlatma/kapatma sırasında tüm geçmişi temizleyecektir.
uk: Якщо його ввімкнено, Pano очистить всю історію виходу з системи/перезапуску/завершення роботи.
vi: Khi đuợc bật, Pano sẽ xóa lịch sử khi đăng thoát/khởi động lại/tắt máy.
zh_cn: 启用后，Pano将在注销/重启/关机时清除所有历史记录。
zh_tw: 啟用時 Pano 會在登出/重新啟動/關機時清除紀錄

source: Database Location
ar: موقع قاعدة البيانات
bg: Местоположение на базата данни
cs: Umístění databáze
da: Database placering
de: Datenbankablage
el: Τοποθεσία βάσης δεδομένων
es: Ubicación de la base de datos
et: Andmebaasi asukoht
fi: Tietokannan sijainti
fr: Emplacement de la base de données
he: מיקום מסד הנתונים
is: Staðsetning gagnagrunns
it: Posizione del database
ko: 데이터베이스 위치
no: Plassering av database
oc: Emplaçament de la basa de donadas
pl: Lokalizacja Bazy Danych
pt: Localização do banco de dados
pt_br: Localização do banco de dados
ro: Locația bazei de date
ru: Расположение базы данных
sk: Umiestnenie databázy
sv: Databasens plats
tr: Veritabanı Konumu
uk: Розташування бази даних
vi: Vị Trí Dữ Liệu
zh_cn: 数据库位置
zh_tw: 資料庫位址

source: Choose pano database location
ar: اختر موقع قاعدة بيانات بانو
bg: Изберете местоположение на базата данни на Пано
cs: Zvolte umístění databáze pano
da: Vælg pano-databaseplacering
de: Pano Datenbankablage wählen
el: Επιλέξτε θέση βάσης δεδομένων pano
es: Elege la ubicación de la base de datos de Pano
et: Pano andmebaasi asukoha valimine
fi: Valitse pano-tietokannan sijainti
fr: Choisissez l’emplacement de la base de données Pano
he: בחר מיקום מסד נתונים של Pano
is: Veldu staðsetningu pano gagnagrunns
it: Scegliere il percorso del database pano
ko: 파노라마 데이터베이스 위치 선택
no: Velg pano database plassering
oc: Causir l'emplaçament de la basa de donadas de pano
pl: Wybierz lokalizację bazy danych pano
pt: Escolher o local do banco de dados pano
pt_br: Escolha o local do banco de dados do Pano
ro: Alegeți locația bazei de date Pano
ru: Выбрать расположение базы данных pano
sk: Vyberte umiestnenie databázy pano
sv: Välj plats för pano-databas
tr: Pano veritabanı konumunu seçin
uk: Вибір розташування бази даних pano
vi: Chọn nơi để chứa dữ liệu của Pano
zh_cn: 选择Pano数据库位置
zh_tw: 選擇 Pano 資料庫位址

source: Failed to select directory
ar: فشل اختيار المجلد
bg: Неуспешно избиране на директория
da: Kunne ikke vælge mappe
de: Ordnerauswahl fehlgeschlagen
el: Αποτυχία επιλογής καταλόγου
es: Error al seleccionar el directorio
et: Kataloogi valimine nurjus
fi: Hakemiston valitseminen epäonnistui
fr: La sélection du répertoire a échouée
he: בחירת הספריה נכשלה
is: Gat ekki valið möppu
it: Impossibile selezionare la directory
ko: 경로를 선택하지 못했습니다
no: Kunne ikke velge katalog
oc: Seleccion del repertòri pas reüssida
pl: Błąd podczas wybierania folderu
pt: Falha ao selecionar o diretório
pt_br: Falha ao selecionar o diretório
ro: Nu a reușit să selectați directorul
ru: Не удалось выбрать каталог
sk: Nepodarilo sa vybrať adresár
sv: Det gick inte att välja katalog
tr: Dizin seçilemedi
uk: Не вдалося вибрати каталог
vi: Không thể chọn thư mục
zh_cn: 选择目录失败
zh_tw: 選取檔案夾錯誤

source: Manage Exclusions
ar: إدارة الاستثناءات
bg: Управление на изключенията
cs: Správa vyloučených aplikací
da: Administrer undtagelser
de: Ausschlüsse verwalten
el: Διαχείριση εξαιρέσεων
es: Administrar exclusiones
et: Välistamiste haldamine
fi: Poikkeusten hallinta
fr: Gérer les exclusions
he: ניהול אי-הכללות
is: Stjórna útilokunum
it: Gestione delle esclusioni
ko: 제외 관리
no: Behandle utelukkelser
oc: Gestion de las exclusions
pl: Zarządzaj Wykluczonymi Aplikacjami
pt: Gerenciar exclusões
pt_br: Gerenciar exclusões
ro: Gestionarea excluderilor
ru: Управление исключениями
sk: Správa vylúčení
sv: Hantera undantag
tr: Hariç Tutulanları Yönet
uk: Керування виключеннями
vi: Quản Lý Ngoại Lệ
zh_cn: 管理排除项
zh_tw: 管理已排除應用程式

source: Excluded Apps
ar: التطبيقات المستثناة
bg: Изключени приложения
cs: Vyloučené aplikace
da: Ekskluderede apps
de: Ausgeschlossene Apps
el: Εξαιρούμενες εφαρμογές
es: Aplicaciones excluidas
et: Välistatud rakendused
fi: Poissuljetut sovellukset
fr: Applications exclues
he: יישומים שאינם נכללים
is: Forrit sem eru undanskilin
it: App escluse
ko: 제외된 앱
no: Ekskluderte apper
oc: Aplicacions exclusas
pl: Wykluczone Aplikacje
pt: Aplicativos excluídos
pt_br: Aplicativos excluídos
ro: Aplicații excluse
ru: Исключенные приложения
sk: Vylúčené aplikácie
sv: Undantagna appar
tr: Hariç Tutulan Uygulamalar
uk: Виключені програми
vi: Ứng Dụng Ngoại Lệ
zh_cn: 排除以下程序
zh_tw: 排除的應用程式

source: Pano will stop tracking if any window from the list is focussed
ar: سيمتنع بانو عن التتبع إذا فُعلت نافذة من هذه القائمة
bg: Pano ще спре проследяването, ако някой прозорец от списъка е фокусиран
cs: Pano přestane sledovat, pokud je vybráno jakékoli okno ze seznamu
da: Pano stopper sporingen, hvis et vindue fra listen er fokuseret
de: Pano wird nichts tracken wenn ein Fenster aus der Liste im Fokus ist
el: Το Pano θα σταματήσει να παρακολουθεί εάν κάποιο παράθυρο από τη λίστα είναι εστιασμένο
es: Pano dejará de rastrearte si alguna ventana de la lista está en primer plano
et: Pano lõpetab jälgimise, kui mõni loendi aken on fokusseeritud
fi: Pano lopettaa seurannan, jos jokin luettelon ikkuna on kohdistettu
fr: Pano arrêtera le suivi si une fenêtre d’une application de la liste est focalisée
he: Pano תפסיק את המעקב אם חלון כלשהו מהרשימה ממוקד
is: Pano mun hætta að fylgjast með ef einhver gluggi af listanum er fókuseraður
it: Pano interromperà il monitoraggio se una finestra dell'elenco è focalizzata
ko: Pano는 목록의 창에 포커스가 있는 경우 추적을 중지
no: Pano vil slutte å spore hvis et vindu fra listen er fokusert
pl: Pano przestanie śledzić jeśli któreś z tych programów jest używane
pt: O Pano interromperá o rastreamento se alguma janela da lista estiver focada
pt_br: O Pano deixará de rastrear se qualquer janela da lista estiver em foco
ro: Pano va opri urmărirea dacă orice fereastră din listă este focalizată
ru: Pano остановит отслеживание если какое-либо окно из списка находится в фокусе
sk: Pano prestane sledovať, ak je zaostrené ktorékoľvek okno zo zoznamu
sv: Pano slutar spåra om något fönster från listan är fokuserat
tr: Listedeki herhangi bir pencereye odaklanılırsa Pano izlemeyi durduracak
uk: Pano припинить відстеження, якщо фокусовано будь-яке вікно зі списку
vi: Pano sẽ ngừng lưu dữ liệu khay nhớ tạm trong cửa sổ của ứng dụng ngoại lệ
zh_cn: 如果选中以下任意程序，Pano将停止监视剪切板
zh_tw: Pano 會在開啟以下應用程式時停止追蹤

source: Window class name
ar: اسم طراز النافذة
bg: Име на класа на прозореца
cs: Název třídy okna
da: Navn på vinduesklasse
de: Fenster Klassename
el: Όνομα κλάσης παραθύρου
es: Nombre de clase de ventana
et: Aknaklassi nimi
fi: Ikkunaluokan nimi
fr: Nom de la classe de la fenêtre
he: שם כיתת חלון
is: Heiti gluggaflokks
it: Nome della classe finestra
ko: 창 클래스 이름
no: Navn på vindusklasse
oc: Nom de classa de la fenèstra
pl: Nazwa programu
pt: Nome da classe Window
pt_br: Nome da classe da janela
ro: Numele clasei de fereastră
ru: Имя класса окна
sk: Názov triedy okna
sv: Namn på fönsterklass
tr: Pencere sınıfı adı
uk: Ім'я класу вікна
vi: Tên của cửa sổ
zh_cn: 窗口类名
zh_tw: 視窗類別名稱

source: General Options
ar: خيارات عامة
bg: Общи опции
cs: Obecné možnosti
da: Generelle indstillinger
de: Allgemeine Optionen
el: Γενικές επιλογές
es: Opciones generales
et: Üldised valikud
fi: Yleiset vaihtoehdot
fr: Options générales
he: אפשרויות כלליות
is: Almennir valkostir
it: Opzioni generali
ko: 일반 옵션
no: Generelle alternativer
oc: Opcions generalas
pl: Ogólne Opcje
pt: Opções Gerais
pt_br: Opções gerais
ro: Opțiuni generale
ru: Общие настройки
sk: Všeobecné možnosti
sv: Allmänna alternativ
tr: Genel seçenekler
uk: Загальні параметри
vi: Tùy Chọn Chung
zh_cn: 常规选项
zh_tw: 一般設定

source: History Length
ar: طول السجل
bg: История Дължина
cs: Délka historie
da: Historiens længde
de: Länge der Historie
el: Διάρκεια Ιστορίας
es: Longitud del historial
et: Ajalugu Pikkus
fi: Historian pituus
fr: Taille de l’historique
he: אורך ההיסטוריה
is: Lengd sögu
it: Lunghezza della storia
ko: 역사 길이
no: Historie Lengde
oc: Talha de l’istoric
pl: Długość Historii
pt: Comprimento do Histórico
pt_br: Tamanho do histórico
ro: Lungimea istoriei
ru: Длина истории
sk: Dĺžka histórie
sv: Historik Längd
tr: Geçmiş Uzunluğu
uk: Тривалість історії
vi: Độ Dài Lịch Sử
zh_cn: 历史记录条数
zh_tw: 歷史長度

source: You can limit your clipboard history length between 10 - 500
ar: يمكنك حصر طول السجل للحافظة بين 10 - 500
bg: Можете да ограничите дължината на историята на клипборда между 10 и 500
cs: Délku historie schránky můžete omezit mezi 10 - 500
da: Du kan begrænse længden af din udklipsholderhistorik mellem 10 - 500
de: Sie können Ihre Zwischenablage limitieren auf ein Länge zwischen 10 - 500
el: Μπορείτε να περιορίσετε το μήκος του ιστορικού του προχείρου μεταξύ 10 - 500
es: Puedes limitar la longitud del historial del portapapeles entre 10 y 500 notas
et: Saate piirata lõikelaua ajaloo pikkust vahemikus 10–500
fi: Voit rajoittaa leikepöydän historian pituutta välillä 10-500
fr: Vous pouvez limiter la taille de l’historique du presse-papiers entre 10 et 500
he: אתה יכול להגביל את אורך היסטוריית הלוח שלך בין 10 - 500
is: Þú getur takmarkað lengd klippispjaldsferilsins á milli 10 - 500
it: È possibile limitare la lunghezza della cronologia degli appunti tra 10 e 500
ko: 클립 보드 기록 길이를 10-500 사이로 제한
no: Du kan begrense utklippstavlens historikklengde mellom 10 - 500
oc: Podètz limitar la talha de l’istoric de copiar pegar entre 10 - 500 entradas
pl: Możesz ograniczyć długość historii od 10 do 500 pozycji
pt: Você pode limitar o comprimento do histórico da área de transferência entre 10 e 500
pt_br: Você pode limitar o tamanho do histórico da área de transferência entre 10 e 500
ro: Puteți limita lungimea istoricului clipboard-ului între 10 și 500
ru: Вы можете ограничить длину истории буфера обмена между 10 - 500
sk: Dĺžku histórie schránky môžete obmedziť na 10 - 500
sv: Du kan begränsa längden på urklippshistoriken mellan 10 och 500
tr: Pano geçmişi uzunluğunu 10 - 500 arasında sınırlayabilirsin
uk: Ви можете обмежити довжину історії буфера обміну від 10 до 500
vi: Bạn có thể giới hạn độ dài lịch sử khau nhớ tạm từ 10 - 500
zh_cn: 剪贴板历史记录长度限制在10-500条之间
zh_tw: 你可以限制剪貼簿大小（10～500 個物件）

source: Incognito Mode Shortcut
ar: اختصار الوضع المخفي
bg: Пряк път в режим "инкогнито"
cs: Zkratka anonymního režimu
da: Genvej i inkognitotilstand
de: Inkognito-Modus Tastaturkürzel
el: Συντόμευση κατάστασης ανώνυμης περιήγησης
es: Acceso directo al modo incógnito
et: Inkognito režiimi otsetee
fi: Incognito-tilan pikakuvake
fr: Raccourci clavier du mode incognito
he: קיצור דרך למצב גלישה בסתר
is: Flýtileið í huliðsstillingu
it: Scorciatoia per la modalità di navigazione in incognito
ko: 시크릿 모드 단축키
no: Snarvei for inkognitomodus
oc: Acorchi mòde incognito
pl: Skrót Klawiszowy Trybu Incognito
pt: Atalho do modo de navegação anónima
pt_br: Atalho do Modo de Navegação Anônima
ro: Comandă rapidă în modul incognito
ru: Комбинация клавиш режима инкогнито
sk: Skratka režimu inkognito
sv: Genväg för inkognitoläge
tr: Gizli Mod Kısayolu
uk: Комбінація клавіш режиму інкогніто
vi: Phím Tắt Chế Độ Ẩn Danh
zh_cn: 隐私模式快捷键
zh_tw: 無痕模式捷徑
