Repository: oae/gnome-shell-pano
Catalog: resources/po/*.po
Languages: ar, bg, cs, da, de, el, es, et, fi, fr, he, is, it, ko, no, oc, pl, pt, pt_br, ro, ru, sk, sv, tr, uk, vi, zh_cn, zh_tw

source: Allows you to toggle incognito mode
ar: يمكنك من تفعيل وإيقاف الوضع المخفي
bg: Позволява ви да превключвате режим "инкогнито"
cs: Umožňuje přepínat anonymní režim
da: Giver dig mulighed for at skifte inkognitotilstand
de: Umschalter des Inkognito-Modus
el: Σας επιτρέπει να κάνετε εναλλαγή της κατάστασης ανώνυμης περιήγησης
es: Te permite activar el modo incógnito
et: Võimaldab teil inkognito režiimi sisse lülitada
fi: Voit vaihtaa incognito-tilaa
fr: Permet de basculer vers le mode incognito
he: מאפשר לך לעבור למצב גלישה בסתר
is: Gerir þér kleift að skipta um huliðsstillingu
it: Consente di attivare o disattivare la modalità di navigazione in incognito
ko: 시크릿 모드로 전환
no: Lar deg bytte inkognitomodus
oc: Vos permet d’alternar lo mòde incognito
pl: Pozwala na przełączenie trybu incognito
pt: Permite alternar o modo de navegação anónima
pt_br: Permite alternar o modo de navegação anônima
ro: Vă permite să comutați modul incognito
ru: Позволяет переключать режим инкогнито
sk: Umožňuje prepínať režim inkognito
sv: Låter dig växla inkognitoläge
tr: Gizli modu açıp kapatmanızı sağlar
uk: Дозволяє перемикати режим інкогніто
vi: Cho phép bạn bật/tắt chế độ ẩn danh
zh_cn: 方便启用或禁用隐私模式
zh_tw: 允許開啟無痕模式

source: Select a shortcut
ar: اختر اختصار لوحة المفاتيح
bg: Избор на пряк път
cs: Vyberte zkratku
da: Vælg en genvej
de: Kürzel auswählen
el: Επιλέξτε μια συντόμευση
es: Seleccionar un acceso directo
et: Otsetee valimine
fi: Valitse pikakuvake
fr: Sélectionnez un raccourci
he: בחירת קיצור דרך
is: Veldu flýtileið
it: Selezionare un collegamento
ko: 단축어 선택
no: Velge en snarvei
oc: Seleccionar un acorchi
pl: Wybierz skrót klawiszowy
pt: Selecione um atalho
pt_br: Selecione um atalho
ro: Selectarea unei scurtături
ru: Выберите комбинацию клавиш
sk: Vyberte skratku
sv: Välj en genväg
tr: Bir kısayol seçin
uk: Вибір ярлика
vi: Chọn phím tắt
zh_cn: 选择快捷键
zh_tw: 選擇一個捷徑

source: New shortcut
ar: اختصار جديد
bg: Нов пряк път
cs: Nová zkratka
da: Ny genvej
de: Neues Kürzel
el: Νέα συντόμευση
es: Nuevo acceso directo
et: Uus otsetee
fi: Uusi pikakuvake
fr: Nouveau raccourci
he: קיצור דרך חדש
is: Ný flýtileið
it: Nuova scorciatoia
ko: 새 단축키
no: Ny snarvei
oc: Acorchi novèl
pl: Nowy skrót klawiszowy
pt: Novo atalho
pt_br: Novo atalho
ro: Comandă rapidă nouă
ru: Новая комбинация клавиш
sk: Nová skratka
sv: Ny genväg
tr: Yeni kısayol
uk: Новий ярлик
vi: Phím tắt mới
zh_cn: 新建快捷键
zh_tw: 新捷徑

source: General
ar: عام
bg: Основни
cs: Obecné
da: Generel
de: Allgemein
el: Γενικά
et: Üldine
fi: Yleiset
fr: Général
he: כללי
is: Almennur
it: Generale
ko: 일반
no: Generelt
pl: Ogólne opcje
pt: Geral
pt_br: Geral
ru: Общее
sk: Všeobecné
sv: Allmänt
tr: Genel
uk: Загальне
vi: Chung
zh_cn: 常规
zh_tw: 一般

source: Keep Search Entry
ar: احتفظ بمدخلة البحث
bg: Запази записа за търсене
cs: Ponechat položku vyhledávání
da: Behold søgeindgangen
de: Behalte Such-Eintrag
el: Διατήρηση καταχώρησης αναζήτησης
es: Mantener entrada de búsqueda
et: Säilita otsingukirje
fi: Säilytä hakumerkintä
fr: Conserver l’entrée de recherche
he: שמור על ערך חיפוש
is: Halda leitarfærslu
it: Mantieni voce di ricerca
ko: 검색 항목 유지
no: Behold søkeoppføringen
oc: Gardar la zòna de recèrca
pt: Manter entrada de pesquisa
pt_br: Manter campo de busca
ro: Păstrați intrarea în căutare
ru: Сохранять поле поиска
sk: Ponechať položku vyhľadávania
sv: Behåll sökposten
tr: Arama Girişini Sakla
uk: Зберегти запис пошуку
zh_cn: 保留搜索条目
zh_tw: 保留搜尋紀錄

source: Keep search entry when Pano hides
ar: احتفظ بمدخلة البحث عند إخفاء بانو
bg: Запазване на записа за търсене, когато Пано се скрие
cs: Ponechat záznam vyhledávání, když se Pano skryje
da: Hold søgeindgangen, når Pano skjuler
de: Behalte Such-Eintrag wenn Pano versteckt wird
el: Διατήρηση καταχώρησης αναζήτησης όταν αποκρύπτεται το Pano
es: Mantener la entrada de búsqueda cuando Pano se esconde
et: Säilita otsingukirje, kui Pano peidab
fi: Säilytä hakumerkintä, kun Pano piiloutuu
fr: Conserver l’entrée de recherche lorsque Pano est masqué
he: שמירת ערך החיפוש כאשר פאנו מסתתר
is: Halda leitarfærslu þegar Pano felur sig
it: Mantieni la voce di ricerca quando Pano si nasconde
ko: Pano가 숨길 때 검색 항목 유지
no: Hold søkeoppføringen når Pano gjemmer seg
oc: Gardar l’entrada de recèrca quand Pano es rescondut
pt: Manter a entrada de pesquisa quando Pano se oculta
pt_br: Manter o campo de busca quando o Pano é ocultado
ro: Păstrați intrarea de căutare atunci când Pano se ascunde
ru: Сохранять поле поиска когда Pano скрывается
sk: Ponechanie položky vyhľadávania, keď sa Pano skryje
sv: Behåll sökposten när Pano gömmer sig
tr: Pano saklandığında arama girişini sakla
uk: Зберігайте запис пошуку, коли Pano приховує
zh_cn: Pano隐藏时保留搜索条目
zh_tw: 當 Pano 隱藏時保留搜尋紀錄

source: Link Previews
ar: معاينة الروابط
bg: Визуализации на връзки
cs: Náhledy odkazů
da: Forhåndsvisninger af links
de: Linkvorschauen
el: Προεπισκοπήσεις συνδέσμων
es: Vista previa de enlaces
et: Eelvaadete linkimine
fi: Linkkien esikatselut
fr: Prévisualisation des liens
he: תצוגות מקדימות של קישורים
it: Anteprime dei collegamenti
ko: 링크 미리보기
no: Link forhåndsvisninger
oc: Apercebuts de ligam
pt: Visualizações de links
pt_br: Previsões de link
ro: Previzualizări link-ul
ru: Предпросмотр ссылок
sk: Ukážky prepojení
sv: Förhandsgranskningar av länkar
tr: Bağlantı Önizlemeleri
uk: Попередній перегляд посилань
zh_cn: 链接预览
zh_tw: 連結預覽

source: Allow Pano to visit links on your clipboard to generate link previews
ar: يسمح لبانو بزيارة الروابط في الحافطة لإنشاء المعاينات
bg: Позволете на Pano да посещава връзки в клипборда, за да генерира визуализации на връзки
cs: Povolte Pano navštěvovat odkazy ve vaší schránce a generovat náhledy odkazů
da: Tillad Pano at besøge links på dit udklipsholder for at generere linkeksempler
de: Pano darf Links besuchen um Vorschauen zu erstellen
el: Επιτρέψτε στο Pano να επισκέπτεται συνδέσμους στο πρόχειρό σας για να δημιουργεί προεπισκοπήσεις συνδέσμων
es: Permitir a Pano consultar los enlaces en el portapapeles para generar vistas previas de enlaces
et: Luba Panol külastada lõikelaual olevaid linke, et luua linkide eelvaateid
fi: Salli Panon käydä leikepöydälläsi olevissa linkeissä linkkien esikatselujen luomiseksi
fr: Permettre à Pano de visiter les liens de votre presse-papiers pour générer un aperçu des sites web
he: אפשר לפאנו לבקר בקישורים בלוח כדי ליצור תצוגות מקדימות של קישורים
is: Leyfðu Pano að heimsækja tengla á klemmuspjaldinu þínu til að búa til forskoðun á tenglum
it: Consenti a Pano di visitare i collegamenti negli Appunti per generare anteprime dei collegamenti
ko: Pano가 클립보드의 링크를 방문하여 링크 미리 보기를 생성하도록 허용
no: Tillat Pano å besøke koblinger på utklippstavlen for å generere forhåndsvisninger av koblinger
oc: Permetre a Pano de visitar los ligams del quichapapièrs per generar los apercebuts de ligam
pt: Permitir que o Pano visite links em sua área de transferência para gerar visualizações de links
pt_br: Permitir que o Pano visite links da sua área de transferência para gerar pré-visualizações de links
ro: Permiteți lui Pano să viziteze linkurile din clipboard pentru a genera previzualizări ale linkurilor
ru: Разрешить Pano посещать ссылки в буфере обмена для создания предпросмотра ссылок
sk: Povoľte spoločnosti Pano navštevovať odkazy vo vašej schránke a generujte ukážky odkazov
sv: Tillåt Pano att besöka länkar på Urklipp för att generera länkförhandsgranskningar
tr: Bağlantı önizlemeleri oluşturmak için Pano'nun bağlantıları ziyaret etmesine izin verin
uk: Дозвольте Pano відвідувати посилання у вашому буфері обміну для створення попереднього перегляду посилань
zh_cn: 允许Pano访问剪贴板上的链接以便生成链接预览
zh_tw: 允許 Pano 訪問連結來擷取網站預覽

source: Open Links in Browser
cs: Otevřít Odkazy v prohlížeči
de: Öffne Links im Browser
es: Abrir enlaces en el navegador
fr: Ouvrir les liens dans le navigateur
it: Apri i link nel browser
ko: 브라우저에서 링크 열기
pt_br: Abrir links no navegador
ru: Открывать сслыки в браузере
tr: Bağlantıları Tarayıcıda Aç
uk: Відкривати посилання в браузері
zh_cn: 在浏览器中打开链接
zh_tw: 開啟連結

source: Allow Pano to open links on your default browser
cs: Povolte Pano otevírat odkazy ve vašem výchozím prohlížeči
de: Pano darf Links im Browser öffnen
es: Permitir a Pano abrir enlaces en tu navegador predeterminado
fr: Permet à Pano d’ouvrir les liens dans votre navigateur par défaut
it: Consenti a Pano di aprire i link nel tuo browser predefinito
ko: Pano가 브라우저에서 링크를 열도록 허용
pt_br: Permitir que o Pano abra links no seu navegador padrão
ru: Разрешить Pano открывать ссылки в браузере по умолчанию
tr: Bağlantıları varsayılan tarayıcıda açması için Pano'ya izin verin
uk: Дозволити Pano відкривати посилання у вашому браузері за замовчуванням
zh_cn: 在默认浏览器中打开链接
zh_tw: 允許 Pano 開啟連結

source: Paste on Select
ar: اللصق عند الاختيار
bg: Постави в Избор
cs: Vložit při výběru
da: Indsæt på Vælg
de: Einfügen bei Auswahl
el: Επικόλληση στην Επιλογή
es: Pegar la selección
et: Kleebi nupule Vali
fi: Liitä Valitse
fr: Coller sur la sélection
he: הדבקה בבחירה
is: Líma á Select
it: Incolla su Seleziona
ko: 선택 시 붙여넣기
no: Lim inn på Velg
oc: Pegar en seleccionant
pl: Wklej po wybraniu
pt: Colar em Selecionar
pt_br: Colar ao selecionar
ro: Lipire pe Selectare
ru: Вставлять при выборе
sk: Prilepiť na Vyberte
sv: Klistra in på Välj
tr: Seçileni yapıştır
uk: Вставляти під час вибору
vi: Dán khi đuợc Chọn
zh_cn: 粘贴在选定内容上
zh_tw: 貼上時選取物件

source: Allow Pano to paste content on select
ar: يسمح لبانو بلصق المحتوى عند الاختيار
bg: Разреши на Pano да поставя съдържание в изберете
cs: Povolte Pano vložit obsah při výběru
da: Tillad Pano at indsætte indhold på vælg
de: Pano darf Inhalte bei Auswahl einfügen
el: Να επιτρέπεται στο Pano η επικόλληση περιεχομένου σε επιλεγμένα
es: Permitir a Pano pegar el contenido seleccionado
et: Luba Panol sisu kleepida valikusse
fi: Salli Panon liittää sisältöä valittuun
fr: Autoriser Pano à coller du contenu sur la sélection
he: אפשר לפאנו להדביק תוכן בבחירה
is: Leyfa Pano að líma efni á veldu
it: Consenti a Pano di incollare il contenuto su seleziona
ko: Pano가 선택 항목에 콘텐츠를 붙여넣도록 허용
no: Tillat Pano å lime inn innhold på utvalgte
oc: Permet a Pano de pegar lo contengut en seleccionant
pl: Pozwala Pano na wklejenie treści po wybraniu
pt: Permitir que o Pano cole conteúdo em selecionar
pt_br: Permitir que o Pano cole conteúdo ao selecionar
ro: Permiteți lui Pano să lipească conținut pe anumite
ru: Разрешить Pano вставлять содержимое при выборе
sk: Povoliť spoločnosti Pano prilepiť obsah na vybraté položky
sv: Tillåt Pano att klistra in innehåll vid markering
tr: Pano'nun içeriği yapıştırmasına izin verir
uk: Дозволити Pano вставляти вміст на вибраний
vi: Cho phép Pano dán nội dung đuợc chọn tức thì
zh_cn: 允许Pano粘贴到所选的内容上
zh_tw: 允許 Pano 在選取時貼上物件

source: Play an Audio on Copy
ar: تشغيل مقطع صوتي عند النسخ
bg: Възпроизвеждане на аудио на копие
cs: Přehrát zvuk při kopírování
da: Afspil en lyd på kopi
de: Audio abspielen beim Kopieren
el: Αναπαραγωγή ήχου σε αντιγραφή
es: Reproducir sonido al copiar
et: Heli esitamine kopeerimisel
fi: Toista ääni kopioitaessa
fr: Jouer un son lors de la copie
he: הפעלת שמע בהעתקה
is: Spilaðu hljóð á afriti
it: Riproduci un audio su Copia
ko: 복사 시 오디오 재생
no: Spill av en lyd på Copy
oc: Jogar un son en copiant
pl: Wydaj dźwięk podczas kopiowania
pt: Reproduzir um áudio ao copiar
pt_br: Tocar um áudio ao copiar
ro: Redarea unui audio pe copiere
ru: Воспроизводить звук при копировании
sk: Prehrávanie zvuku v kópii
sv: Spela upp ett ljud på kopia
tr: Kopyalarken Ses Çal
uk: Відтворення аудіо на копії
vi: Chơi Âm Thanh Khi Sao Chép
zh_cn: 复制时播放提示音
zh_tw: 在複製時播放音效

source: Allow Pano to play an audio when copying new content
ar: يسمح لبانو بتشغيل مقطع صوتي عند نسخ محتوى جديد
bg: Позволяване на Pano да възпроизвежда аудио при копиране на ново съдържание
cs: Při kopírování nového obsahu povolte Pano přehrát zvuk
da: Tillad Pano at afspille en lyd, når du kopierer nyt indhold
de: Pano darf Audio abzuspielen wenn Inhalte kopiert werden
el: Να επιτρέπεται στο Pano η αναπαραγωγή ήχου κατά την αντιγραφή νέου περιεχομένου
es: Permitir que Pano reproduzca un audio al copiar contenido nuevo
et: Luba Panol uue sisu kopeerimisel heli esitada
fi: Anna Panon toistaa ääntä, kun kopioit uutta sisältöä
fr: Autoriser Pano à jouer un son lors de la copie de nouveau contenu
he: אפשר ל-Pano להשמיע שמע בעת העתקת תוכן חדש
is: Leyfa Pano að spila hljóð þegar þú afritar nýtt efni
it: Consenti a Pano di riprodurre un audio durante la copia di nuovi contenuti
ko: Pano가 새 콘텐츠를 복사할 때 오디오를 재생하도록 허용
no: Tillat Pano å spille av en lyd når du kopierer nytt innhold
oc: Permet a Pano de jogar un son quand un contengut novèl es copiat
pl: Pozwala Pano na wydanie dźwięku podczas kopiowania
pt: Permitir que o Pano reproduza um áudio ao copiar um novo conteúdo
pt_br: Permitir que o Pano toque um áudio ao copiar novo conteúdo
ro: Permiteți-i lui Pano să redea un sunet atunci când copiază conținut nou
ru: Разрешить Pano воспроизводить звук при копировании нового содержимого
sk: Povolenie prehrávania zvuku spoločnosťou Pano pri kopírovaní nového obsahu
sv: Tillåt Pano att spela upp ett ljud när du kopierar nytt innehåll
tr: Pano'nun yeni bir içerik kopyalarken ses çalmasına izin verir
uk: Дозволити Pano відтворювати аудіо під час копіювання нового вмісту
vi: Cho phép Pano chơi âm thanh báo khi chép dữ liệu mới
zh_cn: 允许Pano在复制新内容时播放声音提示
zh_tw: 允許 Pano 在複製新物件時播放音效

source: Send Notification on Copy
cs: Odeslat oznámení o kopírování
de: Sende Benachrichtigung beim Kopieren
es: Enviar una notificación al copiar
fr: Envoyer une notification lors de la copie
it: Invia notifica su copia
ko: 복사 시 알림 보내기
pt_br: Enviar notificação ao copiar
ru: Отправить уведомление о копировании
tr: Kopyalarken Bildirim Gönder
uk: Надсилати сповіщення під час копіювання
zh_cn: 复制时弹出提醒
zh_tw: 複製時傳送訊息

source: Allow Pano to send notification when copying new content
cs: Povolte Pano odesílat upozornění při kopírování nového obsahu
de: Pano darf Benachrichtigungen beim Kopieren neuer Inhalte senden
es: Permitir a Pano enviar una notificación al copiar nuevo contenido
fr: Permet à Pano d’envoyer une notification lors de la copie d’un nouvel élément
it: Consenti a Pano di inviare notifiche durante la copia di nuovi contenuti
ko: Pano가 새 콘텐츠를 복사할 때 알림을 보내도록 허용
pt_br: Permitir que o Pano envie notificação ao copiar novo conteúdo
ru: Разрешить Pano отправлять уведомления при копировании нового контента
tr: Yeni içerik kopyalarken Pano'nun bildirim göndermesine izin ver
uk: Дозволити Pano надсилати сповіщення під час копіювання нового вмісту
zh_cn: 复制新内容时，Pano将弹出系统提醒
zh_tw: 允許 Pano 在複製新物件時傳送通知

source: Global Shortcut
ar: اختصار لوحة المفاتيح
bg: Глобален пряк път
cs: Globální zkratka
da: Global genvej
de: Globales Tastaturkürzel
el: Καθολική συντόμευση
es: Acceso directo global
et: Globaalne otsetee
fi: Maailmanlaajuinen pikakuvake
fr: Raccourcis globaux
he: קיצור דרך כללי
is: Altæk flýtileið
it: Scorciatoia globale
ko: 전역 단축키
no: Global snarvei
oc: Acorchis general
pl: Główny Skrót Klawiszowy
pt: Atalho Global
pt_br: Atalho Global
ro: Comandă rapidă globală
ru: Глобальная комбинация клавиш
sk: Globálna skratka
sv: Global genväg
tr: Genel Kısayol
uk: Глобальний ярлик
vi: Phím Tắt Toàn Cầu
zh_cn: 全局快捷键
zh_tw: 全域捷徑

source: Allows you to toggle visibility of the clipboard manager
ar: يمكنّك من إظهار وإخفاء مدير الحافظة
bg: Позволява ви да превключвате видимостта на мениджъра на клипборда
cs: Umožňuje vám přepínat viditelnost správce schránky
da: Giver dig mulighed for at skifte synlighed af udklipsholderen
de: Umschalter zur Anzeige der Zwischenablage-Verwaltung
el: Σας επιτρέπει να εναλλάσσετε την ορατότητα του διαχειριστή προχείρου
es: Te permite alternar la visibilidad del administrador del portapapeles
et: Võimaldab lõikelauahalduri nähtavust sisse lülitada
fi: Voit vaihtaa leikepöydän hallinnan näkyvyyttä
fr: Permet de basculer la visibilité du gestionnaire de presse-papiers
he: מאפשר לך להחליף את הנראות של מנהל הלוח
is: Gerir þér kleift að víxla sýnileika klippispjaldsstjórans
it: Consente di attivare o disattivare la visibilità del gestore degli appunti
ko: 클립 보드 관리자의 가시성을 전환
no: Lar deg veksle synligheten til utklippstavlebehandleren
oc: Vos permet d’alternar la visibilitat del gestionari de copiar pegar
pl: Pozwala na przełączenie pokazanie głównego okna pano
pt: Permite alternar a visibilidade do gerenciador da área de transferência
pt_br: Permite alternar a visibilidade do gerenciador de área de transferência
ro: Vă permite să comutați vizibilitatea managerului de clipboard
ru: Позволяет переключать видимость менеджера буфера обмена
sk: Umožňuje prepnúť viditeľnosť správcu schránky
sv: Låter dig växla synlighet för urklippshanteraren
tr: Pano yöneticisinin görünürlüğünü değiştirmenizi sağlar
uk: Дозволяє переключити видимість менеджера буфера обміну
vi: Cho phép bạn hiển thị/ẩn trình quản lý khay nhớ tạm
zh_cn: 允许显示或隐藏剪贴板管理器
zh_tw: 允許切換剪貼簿可見度

source: Show Indicator
ar: أظهر أيقونة القائمة
bg: Покажи индикатора
cs: Zobrazit indikátor
da: Vis indikator
de: Indikator anzeigen
el: Εμφάνιση δείκτη
es: Mostrar indicador
et: Näita indikaatorit
fi: Näytä ilmaisin
fr: Afficher un indicateur
he: הצג מחוון
is: Sýna vísir
it: Mostra indicatore
ko: 표시기 표시
no: Vis indikator
oc: Afichar l'indicator
pl: Pokaż Wskaźnik
pt: Mostrar indicador
pt_br: Mostrar Indicador
ro: Afișare indicator
ru: Показывать индикатор
sk: Zobraziť indikátor
sv: Visa indikator
tr: Gösterge ekle
uk: Показати індикатор
vi: Hiện Thị Chỉ Báo
zh_cn: 显示托盘指示器
zh_tw: 顯示圖示

source: Shows an indicator on top panel
ar: أظهر أيقونة القائمة في الشريط العلوي
bg: Показва индикатор на горния панел
cs: Zobrazuje ikonu na horním panelu
da: Viser en indikator på toppanelet
de: Indikator wird im oberen Bedienfeld angezeigt
el: Εμφανίζει μια ένδειξη στον επάνω πίνακα
es: Muestra un indicador en el panel superior
et: Kuvab näidiku ülemisel paneelil
fi: Näyttää ilmaisimen yläpaneelissa
fr: Affiche un indicateur sur le panneau supérieur
he: הצגת מחוון בלוח העליון
is: Sýnir vísi á efsta spjaldi
it: Mostra un indicatore sul pannello superiore
ko: 상단 패널에 표시기를 표시
no: Viser en indikator på topppanelet
oc: Aficha un indicator al panèl superior
pl: Pokazuje wskaźnik na górnym pasku
pt: Mostra um indicador no painel superior
pt_br: Mostra um indicador na barra superior
ro: Afișează un indicator în panoul superior
ru: Показывать индикатор на верхней панели
sk: Zobrazuje indikátor na hornom paneli
sv: Visar en indikator på den övre panelen
tr: Üst panelde bir gösterge ekler
uk: Показує індикатор на верхній панелі
vi: Hiển Thị Chỉ Báo ở panel trên
zh_cn: 在顶栏显示程序指示器
zh_tw: 在頂欄顯示圖示

source: Sync Primary
ar: مزامنة التحديد الرئيسي
bg: Първично синхронизиране
cs: Synchronizace primárního výběru
da: Synkroniser primært
de: Primär synchronisieren
el: Συγχρονισμός κύριας
es: Sincronizar selección
et: Sünkrooni esmane
fi: Synkronoi ensisijainen
fr: Synchroniser la sélection primaire
he: סינכרון ראשי
is: Samstilling aðal
it: Sincronizza principale
ko: 기본 동기화
no: Synkroniser primær
pt: Sincronizar primário
pt_br: Sincronizar Primário
ro: Sincronizare primară
ru: Синхронизировать основной
sk: Synchronizácia primárnej
sv: Synkronisera primärt
tr: Birincil Geçmiş Senkronizasyonu
uk: Первинна синхронізація
zh_cn: 同步
zh_tw: 同步

source: Sync primary selection with clipboard selection
ar: مزامنة التحديد الرئيسي مع تحديد الحافظة
bg: Синхронизиране на първичната селекция с избора на клипборд
cs: Synchronizace primárního výběru s výběrem ze schránky
da: Synkronisere primær markering med markering af udklipsholder
de: Primäre Auswahl mit der Auswahl der Zwischenablage synchronisieren
el: Συγχρονισμός κύριας επιλογής με επιλογή προχείρου
es: Sincronizar la selección principal con la selección del portapapeles
et: Esmase valiku sünkroonimine lõikelaua valikuga
fi: Synkronoi ensisijainen valinta leikepöydän valinnan kanssa
fr: Synchroniser la sélection primaire avec la sélection du presse-papiers
he: סינכרון בחירה ראשית עם בחירת הלוח
is: Samræma aðalval við val á klippispjaldi
it: Sincronizzare la selezione principale con la selezione degli Appunti
ko: 기본 선택 항목을 클립보드 선택과 동기화
no: Synkroniser primærvalg med valg av utklippstavle
pt: Sincronizar a seleção principal com a seleção da área de transferência
pt_br: Sincroniza a seleção primária com a seleção da área de transferência
ro: Sincronizarea selecției primare cu selecția clipboard-ului
ru: Синхронизировать прямое выделение с буфера обмена
sk: Synchronizácia primárneho výberu s výberom schránky
sv: Synkronisera primärmarkering med urklippsmarkering
tr: Birincil geçmiş ile ana geçmişi senkronize et
uk: Синхронізація основного виділення з виділенням буфера обміну
zh_cn: 将最近的选区与剪贴板同步
zh_tw: 同步主要選取與剪貼簿選取

source: Watch Exclusions
ar: راقب الاستثناءات
bg: Гледайте изключенията
cs: Sledování vyloučených aplikací
da: Se undtagelser
de: Ausschlüsse überwachen
el: Εξαιρέσεις παρακολούθησης
es: Ver exclusiones
et: Vaadake välistusi
fi: Katso poissulkemiset
fr: Voir les exclusions
he: צפה בהחרגות
is: Úrútilokanir
it: Guarda le esclusioni
ko: 제외 항목 보기
no: Se ekskluderinger
oc: Veire las exlusions
pl: Używaj Wykluczonych Aplikacji
pt: Exclusões de Exibição
pt_br: Exclusões de Monitoramento
ro: Urmăriți Excluderile
ru: Отслеживать исключения
sk: Vylúčenia pozerania
sv: Titta på undantag
tr: İstisnaları İzle
uk: Дивитися виключення
vi: Theo Dõi Ứng Dụng Ngoại Lệ
zh_cn: 监视排除对象
zh_tw: 查看擴充套件

source: When enabled, Pano will not track clipboard from excluded apps
ar: عند التمكين لن يتعقب بانو حافظة التطبيقات المستثناة
bg: Когато е активиран, Pano няма да проследява клипборда от изключени приложения
cs: Je-li tato možnost povolena, nebude Pano sledovat schránku z vyloučených aplikací
da: Når den er aktiveret, sporer Pano ikke udklipsholder fra ekskluderede apps
de: Wenn aktiviert, wird Pano die ausgeschlossenen Apps nicht tracken
el: Όταν είναι ενεργοποιημένη, η Pano δεν θα παρακολουθεί το πρόχειρο από τις εξαιρούμενες εφαρμογές
es: Cuando está habilitado, Pano no rastreará el portapapeles de las aplicaciones excluidas
et: Kui see on lubatud, ei jälgi Pano lõikelauda välistatud rakendustest
fi: Kun tämä on käytössä, Pano ei seuraa leikepöytää poissuljetuista sovelluksista
fr: Lorsque cette option est activée, Pano ne suivra pas le presse-papiers depuis les applications exclues
he: כאשר אפשרות זו מופעלת, Pano לא תעקוב אחר הלוח מאפליקציות שאינן נכללות
is: Þegar þetta er virkt mun Pano ekki fylgjast með klippispjaldi úr forritum sem eru útilokuð
it: Se abilitato, Pano non tiene traccia degli appunti dalle app escluse
ko: 활성화되면 Pano는 제외 된 앱의 클립 보드를 추적하지 않습니다
no: Når den er aktivert, vil ikke Pano spore utklippstavle fra ekskluderte apper
oc: Quand es activat, Pano traçarà pas quichapapièrs de las aplicacions exclusas
pl: Kiedy włączone, Pano nie będzie rejestrować schowka z wykluczonych aplikacji
pt: Quando ativado, o Pano não rastreará a área de transferência de aplicativos excluídos
pt_br: Quando ativado, o Pano não irá monitorar a área de transferência de aplicativos excluídos
ro: Când este activat, Pano nu va urmări clipboard-ul din aplicațiile excluse
ru: Когда включено, Pano не будет отслеживать буфер обмена из исключенных приложений
sk: Ak je zapnutá, Pano nebude sledovať schránku z vylúčených aplikácií
sv: När det är aktiverat spårar Pano inte Urklipp från uteslutna appar
tr: Etkinleştirildiğinde Pano, hariç tutulanlardaki içerikleri izlemeyecektir
uk: Якщо ввімкнено, Pano не відстежуватиме буфер обміну з виключених програм
vi: Khi đuợc bât, Pano sẽ không lưu dữ liệu đuợc sao chép vào bộ nhớ tạm trong những ứng dụng ngoại lệ
zh_cn: 启用后，Pano将不会监视被排除程序的剪贴板
zh_tw: 啟用時 Pano 不會在已排除的應用程式內追蹤
