Repository: oae/gnome-shell-pano
Catalog: resources/po/*.po
Languages: ar, bg, cs, da, de, el, es, et, fi, fr, he, is, it, ko, no, oc, pl, pt, pt_br, ro, ru, sk, sv, tr, uk, vi, zh_cn, zh_tw

source: Cancel
ar: إلغاء
bg: Отмени
cs: Zrušit
da: Aflyse
de: Abbrechen
el: Ακυρώνω
es: Cancelar
et: Tühistama
fi: Perua
fr: Annuler
he: ביטל
is: Afturkalla
it: Annulla
ko: 취소
no: Annullere
oc: Anullar
pl: Anuluj
pt: Cancelar
pt_br: Cancelar
ro: Anula
ru: Отмена
sk: Zrušiť
sv: Annullera
tr: İptal
uk: Скасувати
vi: Hủy
zh_cn: 取消
zh_tw: 取消

source: Clear
ar: إزالة
bg: Ясен
cs: Vymazat
da: Tydelig
de: Leeren
el: Σαφής
es: Borrar
et: Selge
fi: Selvä
fr: Vider
he: צלול
is: Skýr
it: Chiaro
ko: 지우기
no: Klar
oc: Escafar
pl: Wyczyść
pt: Claro
pt_br: Limpar
ro: Clar
ru: Очистить
sk: Jasný
sv: Klar
tr: Temizle
uk: Очистити
vi: Xóa
zh_cn: 清除
zh_tw: 清除

source: Clear History
ar: إزالة السجل
bg: Изчистване на хронологията
cs: Vymazat historii
da: Klar historie
de: Chronik löschen
el: Εκκαθάριση ιστορικού
es: Borrar el historial
et: Selge ajalugu
fi: Tyhjennä historia
fr: Vider l’historique
he: נקה היסטוריה
is: Hreinsa sögu
it: Cancella cronologia
ko: 기록 지우기
no: Tøm historikk
oc: Escafar l’istoric
pl: Wyczyść Historię
pt: Limpar histórico
pt_br: Limpar Histórico
ro: Istoric clar
ru: Очистить историю
sk: Vymazať históriu
sv: Rensa historik
tr: Geçmişi Temizle
uk: Очистити історію
vi: Xóa Lịch Sử
zh_cn: 清除历史记录
zh_tw: 清除歷史紀錄

source: Are you sure you want to clear history?
ar: هل أنت متأكد من رغبتك بإزالة السجل؟
bg: Сигурни ли сте, че искате да изчистите историята?
cs: Opravdu chcete vymazat historii?
da: Er du sikker på, at du vil rydde historien?
de: Sind Sie sicher das Sie die Chronik löschen möchten?
el: Είστε σίγουροι ότι θέλετε να καθαρίσετε την ιστορία;
es: ¿Estás seguro de que quieres borrar el historial?
et: Kas olete kindel, et soovite ajalugu kustutada?
fi: Oletko varma, että haluat tyhjentää historian?
fr: Êtes-vous sûr de vouloir vider l’historique ?
he: האם אתה בטוח שברצונך לנקות את ההיסטוריה?
is: Ertu viss um að þú viljir hreinsa söguna?
it: Sei sicuro di voler cancellare la cronologia?
ko: 기록을 지우시겠습니까?
no: Er du sikker på at du vil tømme historikken?
oc: Volètz vertadièrament escafar l’istoric ?
pl: Czy jesteś pewny, że chcesz wyczyścić historię?
pt: Tem certeza de que deseja limpar a história?
pt_br: Tem certeza de que deseja limpar o histórico?
ro: Ești sigur că vrei să limpezești istoria?
ru: Вы уверены что хотите очистить историю?
sk: Ste si istí, že chcete vyčistiť históriu?
sv: Är du säker på att du vill rensa historiken?
tr: Geçmişi temizlemek istediğine emin misiniz?
uk: Ви впевнені, що хочете очистити історію?
vi: Bạn chắc bạn có muốn xóa lịch sử không?
zh_cn: 确定要清除历史记录吗？
zh_tw: 是否清除歷史紀錄

source: Incognito Mode
ar: الوضع المخفي
bg: Режим "инкогнито"
cs: Anonymní režim
da: Inkognitotilstand
de: Inkognito-Modus
el: Ανώνυμης
es: Modo incógnito
et: Inkognito režiim
fi: Incognito-tila
fr: Mode incognito
he: מצב גלישה בסתר
is: Huliðsstilling
it: Modalità di navigazione in incognito
ko: 시크릿 모드
no: Inkognitomodus
oc: Mòde incognito
pl: Tryb Incognito
pt: Modo de navegação anónima
pt_br: Modo anônimo
ro: Modul incognito
ru: Режим инкогнито
sk: Režim inkognito
sv: Inkognitoläge
tr: Gizli Mod
uk: Режим інкогніто
vi: Chế Độ Ẩn Danh
zh_cn: 隐身模式
zh_tw: 無痕模式

source: Settings
ar: الإعدادات
bg: Настройки
cs: Nastavení
da: Indstillinger
de: Einstellungen
el: Ρυθμίσεις
es: Configuración
et: Seaded
fi: Asetukset
fr: Paramètres
he: הגדרות
is: Stillingar
it: Impostazioni
ko: 설정
no: Innstillinger
oc: Paramètres
pl: Ustawienia
pt: Configurações
pt_br: Configurações
ro: Setări
ru: Настройки
sk: Nastavenia
sv: Inställningar
tr: Ayarlar
uk: Параметри
vi: Cài Đặt
zh_cn: 设置
zh_tw: 設定

source: No Description
cs: Bez popisu
de: Keine Beschreibung
es: Sin descripción
fr: Aucune description
it: Nessuna descrizione
ko: 설명 없음
pt_br: Sem descrição
ru: Без описания
tr: Açıklama Yok
uk: Без опису
zh_cn: 无详情
zh_tw: 無說明

source: Type to search, Tab to cycle
cs: Pište pro vyhledávání, Tab pro cyklování mezi kategoriemi
de: Tippen zum Suchen, Tab zum Wechseln
es: Escriba para buscar. Pulsa el tabulador para navegar
fr: Taper pour rechercher, Tabulation pour trier
it: Digita per cercare, Tab per scorrere
ko: 검색하려면 입력, Tab으로 전환
pt_br: Digite para pesquisar, Tab para mudar
ru: Введите для поиска или нажмите Tab для переключения
tr: Aramak için yazın, gezinmek için Tab'a basın
uk: Введіть для пошуку, Tab для перемикання
zh_cn: 输入即搜索，Tab键循环
zh_tw: 輸入以搜尋，按 Tab 循環

source: Change the style of the code item
cs: Změňte styl položky kódu
de: Stils des Code-Eintrags ändern
es: Cambia el estilo de las notas de código
fr: Changer le style de l’élément de code
it: Cambia lo stile dell'elemento di codice
ko: 코드의 스타일을 바꾸기
pt_br: Mudar o estilo do item de código
ru: Изменить стиль элемента с кодом
tr: Kod öğesinin stilini değiştirin
uk: Змінити стиль елемента коду
zh_cn: 修改代码项目的风格
zh_tw: 切換程式碼物件主題

source: Code Item Style
cs: Kód - nastavení stylů
de: Stil des Code-Eintrags
es: Estilo de las notas de código
fr: Style de l’élément de code
it: Codice Voce Stile
ko: 코드 스타일
pt_br: Estilo do item de código
ru: Стиль элемента с кодом
tr: Kod Öğe Stili
uk: Стиль елемента коду
zh_cn: 代码项目风格
zh_tw: 程式物件主題

source: Header Background Color
cs: Barva pozadí záhlaví
de: Hintergrundfarbe der Überschrift
es: Color de fondo del encabezado
fr: Couleur de fond de l’en-tête
it: Colore di sfondo dell'intestazione
pt_br: Cor de fundo do cabeçalho
ru: Цвет фона заголовка
tr: Başlık Arka Plan Rengi
zh_cn: 标题背景色
zh_tw: 標題背景顏色

source: You can change the background color of the header
cs: Můžete změnit barvu pozadí záhlaví
de: Sie können die Hintergrundfarbe der Überschrift ändern
es: Puedes cambiar el color de fondo del encabezado
fr: Vous pouvez modifier la couleur d’arrière-plan de l’en-tête
it: Puoi cambiare il colore di sfondo dell'intestazione
pt_br: Você pode mudar a cor de fundo do cabeçalho
ru: Вы можете изменить цвет фона заголовка
tr: Başlık arka plan rengini değiştirebilirsiniz.
zh_cn: 修改标题背景颜色
zh_tw: 你可以更換背景顏色的

source: Header Text Color
cs: Barva textu záhlaví
de: Textfarbe der Überschrift
es: Color del texto del encabezado
fr: Couleur du texte de l’en-tête
it: Colore del testo dell'intestazione
pt_br: Cor do texto do cabeçalho
ru: Цвет текста заголовка
tr: Başlık Yazı Rengi
zh_cn: 标题文字颜色
zh_tw: 標題字體顏色

source: You can change the text color of the header
cs: Můžete změnit barvu textu záhlaví
de: Sie können die Textfarbe der Überschrift ändern
es: Puedes cambiar el color del texto del encabezado
fr: Vous pouvez modifier la couleur du texte de l’en-tête
it: Puoi cambiare il colore del testo dell'intestazione
pt_br: Você pode mudar a cor do texto do cabeçalho
ru: Вы можете изменить цвет текста в заголовке
tr: Başlık yazı rengini değiştirebilirsiniz
zh_cn: 修改标题文字颜色
zh_tw: 你可以更換視窗標頭字體顏色

source: Body Background Color
cs: Barva pozadí těla
de: Hintergrundfarbe des Hauptteils
es: Color de fondo del cuerpo
fr: Couleur de fond du contenu
it: Colore di sfondo del corpo
pt_br: Cor de fundo do corpo
ru: Цвет фона содержимого
tr: Gövde Arkaplan Rengi
zh_cn: 正文背景色
zh_tw: 內容背景顏色

source: You can change the background color of the body
cs: Můžete změnit barvu pozadí těla
de: Sie können die Hintergrundfarbe des Hauptteils ändern
es: Puedes cambiar el color del cuerpo
fr: Vous pouvez modifier la couleur d’arrière-plan du contenu
it: Puoi cambiare il colore di sfondo del corpo
ko: 내용 배경의 색상을 바꾸기
pt_br: Você pode mudar a cor de fundo do corpo
ru: Вы можете изменить цвет фона содержимого
tr: Gövde arkaplan rengini değiştirebilirsiniz
uk: Ви можете змінити колір фону тіла
zh_cn: 修改正文背景颜色
zh_tw: 你可以更換內容的背景顏色

source: Body Font
cs: Písmo těla
de: Schriftart des Hauptteils
es: Tipografía del cuerpo
fr: Police du contenu
it: Carattere del corpo
ko: 내용 글꼴
pt_br: Fonte do corpo
ru: Шрифт содержимого
tr: Gövde Yazı Tipi
uk: Шрифт тіла
zh_cn: 正文字体
zh_tw: 內容字體

source: You can change the font of the body
cs: Můžete změnit písmo těla
de: Sie können die Schriftart des Hauptteils ändern
es: Puedes cambiar el tipo de letra del cuerpo
fr: Vous pouvez modifier la police du contenu
it: Puoi cambiare il carattere del corpo
pt_br: Você pode mudar a fonte do corpo
ru: Вы можете изменить шрифт содержимого
tr: Gövde yazı tipini değiştirebilirsiniz
uk: Ви можете змінити шрифт тіла
zh_cn: 修改正文字体
zh_tw: 你可以更換內容的字體

source: Character Length
cs: Počet znaků
de: Zeichenlänge
es: Número de caracteres
fr: Nombre de caractères
it: Lunghezza caratteri
pt_br: Comprimento de caracteres
ru: Длина содержимого
tr: Karakter Uzunluğu
uk: Довжина символів
zh_cn: 字符长度
zh_tw: 字串長度

source: You can change the character length of the visible text in the body
cs: Můžete změnit počet znaků viditelného textu v těle
de: Sie können die Zeichenlänge des sichtbaren Textes im Hauptteil ändern
es: Puedes cambiar el número de caracteres visibles del texto en el cuerpo
fr: Vous pouvez modifier la longueur du texte affiché dans le contenu
it: Puoi modificare la lunghezza dei caratteri del testo visibile nel corpo
pt_br: Você pode mudar o comprimento de caracteres do texto visível no corpo
ru: Вы можете изменить длину отображаемого текста в теле карточки
tr: Gövdedeki görünebilir yazıların karakter uzunluğunu değiştirebilirsiniz
uk: Ви можете змінити довжину видимого тексту в тілі
zh_cn: 修改正文文本在预览时显示的字数
zh_tw: 你可以更換內容的可見字串長度

source: Change the style of the color item
cs: Změňte styly barvy
de: Ändern des Stils des Farbeintrags
es: Cambia el estilo de las notas de color
fr: Changer le style de l’élément de couleur
it: Cambia lo stile del colore dell'elemento
ko: 색상 항목의 스타일을 바꾸기
pt_br: Mudar o estilo do item de cor
ru: Изменить стиль элемента с цветом
tr: Renk öğesinin tarzını değiştir
uk: Змінити стиль елемента кольору
zh_cn: 修改色彩项目风格
zh_tw: 切換顏色物件主題

source: Color Item Style
cs: Barva - nastavení stylů
de: Stil des Farb-Eintrags
es: Estilo de las notas de color
fr: Style de l’élément de couleur
it: Stile colore elemento
ko: 색상 항목 스타일
pt_br: Estilo do item de cor
ru: Стиль элемента с цветом
tr: Renk Öğesi Tarzı
uk: Стиль елемента кольору
zh_cn: 色彩项目风格
zh_tw: 顏色物件主題

source: Metadata Background Color
cs: Barva pozadí metadat
de: Metadaten Hintergrundfarbe
es: Color de fondo de los metadatos
fr: Couleur de fond des métadonnées
it: Colore di sfondo dei metadati
pt_br: Cor de fundo dos metadados
ru: Цвет фона метаданных
tr: Metaveri Arkaplan Rengi
zh_cn: 元数据背景色
zh_tw: 詮釋資料背景顏色

source: You can change the background color of the metadata
cs: Můžete změnit barvu pozadí metadat
de: Sie können die Hintergrundfarbe der Metadaten ändern
es: Puedes cambiar el color de fondo de los metadatos
fr: Vous pouvez modifier la couleur d’arrière-plan des métadonnées
it: Puoi cambiare il colore di sfondo dei metadati
pt_br: Você pode mudar a cor de fundo dos metadados
ru: Вы можете изменить цвет фона элемента со ссылкой
tr: Metaveri arkaplan rengini değiştirebilirsiniz
zh_cn: 修改元数据背景颜色
zh_tw: 你可以更換詮釋資料的背景顏色

source: Metadata Text Color
de: Metadaten Textfarbe
it: Colore del testo dei metadati
pt_br: Cor do texto dos metadados
ru: Цвет текста ссылки

source: You can change the text color of the metadata
de: Sie können die Textfarbe der Metadaten ändern
it: Puoi cambiare il colore del testo dei metadati
pt_br: Você pode mudar a cor do texto dos metadados
ru: Вы можете изменить цвет текста ссылки

source: You can change the font of the metadata
cs: Můžete změnit písmo metadat
de: Sie können die Schriftart der Metadaten ändern
es: Puedes cambiar el tipo de letra de los metadatos
fr: Vous pouvez modifier la police des métadonnées
it: Puoi cambiare il carattere dei metadati
pt_br: Você pode mudar a fonte dos metadados
ru: Вы можете изменить шрифт метаданных
tr: Metaveri yazı tipini değiştirebilirsiniz
uk: Ви можете змінити шрифт метаданих
zh_cn: 修改元数据文本字体
zh_tw: 你可以更換詮釋資料的字體

source: Common
cs: Obecné
de: Allgemein
es: Estilos generales
fr: Commun
it: Comune
ko: 일반
pt_br: Comum
tr: Genel
uk: Загальне
zh_cn: 共性
zh_tw: 一般

source: Icon Pack
cs: Sada ikon
es: Paquete de iconos
fr: Pack d’icônes
it: Pacchetto icone
ko: 아이콘 팩
pt_br: Pacote de ícones
ru: Набор иконок
tr: Simge Paketi
uk: Пакет іконок
zh_cn: 图标包
zh_tw: 圖示包

source: You can change the icon pack
cs: Můžete změnit sadu ikon
de: Sie können die Textfarbe das Symbolpaket ändern
es: Elige un paquete de iconos
fr: Vous pouvez changer le pack d’icônes
it: Puoi cambiare il pacchetto di icone
ko: 아이콘 팩을 바꾸기
pt_br: Você pode mudar o pacote de ícones
ru: Вы можете изменить набор иконок
tr: Simge paketini değiştirebilirsiniz
uk: Ви можете змінити пакет іконок
zh_cn: 修改图标包
zh_tw: 你可以更換圖示包

source: Default Icons
cs: Výchozí ikony
de: Standard-Icons
es: Iconos por defecto
fr: Icônes par défaut
it: Icone predefinite
pt_br: Ícones padrão
ru: Стандартные иконки
tr: Varsayılan Simgeler
uk: Значки за замовчуванням
zh_cn: 默认图标
zh_tw: 預設圖示

source: Legacy Icons
cs: Starší ikony
es: Iconos heredados
fr: Anciennes icônes
it: Icone legacy
pt_br: Ícones antigos
ru: Устаревшие иконки
tr: Eski Simgeler
uk: Класичні значки
zh_cn: 传统图标
zh_tw: 復古圖示

source: Item Size
de: Objektgröße
ko: 항목 크기
pt_br: Tamanho do item
ru: Размер элемента
tr: Simge Boyutu

source: You can change the item size
de: Sie können die Objektgröße ändern
pt_br: Você pode mudar o tamanho do item
ru: Вы можете изменить размер элемента
tr: Öğe boyutunu değiştirebilirsiniz

source: Window Position
cs: Poloha okna
de: Fensterposition
es: Posición de la ventana
fr: Position de la fenêtre
pt_br: Posição da janela
ru: Положение окна
tr: Pencere Konumu
zh_cn: 窗口位置
zh_tw: 視窗位置

source: You can change position of the Pano
cs: Můžete změnit pozici Pano
de: Sie können die Position von Pano ändern
es: Elige la posición de la ventana de Pano
fr: Vous pouvez modifier la position de Pano
pt_br: Você pode mudar a posição do Pano
ru: Вы можете изменить положение Pano
tr: Pencere konumunu değiştirebilirsiniz
zh_cn: 修改Pano窗口的位置
zh_tw: 你可以更換 Pano 的位置

source: Bottom
cs: Dole
de: Unten
es: Abajo
fr: En bas
ko: 아래
pt_br: Inferior
tr: Alt
zh_cn: 底部
zh_tw: 底部

source: Left
cs: Vlevo
de: Links
es: A la izquierda
fr: À gauche
ko: 왼쪽
pt_br: Esquerda
tr: Sol
zh_cn: 左侧
zh_tw: 左邊

source: Right
cs: Vpravo
de: Rechts
es: A la derecha
fr: À droite
ko: 오른쪽
pt_br: Direita
tr: Sağ
zh_cn: 右侧
zh_tw: 右邊

source: Top
cs: Nahoře
de: Oben
es: Arriba
fr: En haut
ko: 위
pt_br: Superior
tr: Üst
zh_cn: 顶部
zh_tw: 頂部

source: Window Background Color
cs: Barva pozadí okna
de: Hintergrundfarbe des Fensters
es: Color de fondo de la ventana
fr: Couleur d’arrière-plan de la fenêtre
it: Colore di sfondo della finestra
pt_br: Cor de fundo da janela
ru: Цвет фона окна
tr: Pencere Arkaplan Rengi
zh_cn: 窗口背景色
zh_tw: 視窗背景顏色

source: You can change the window background color
cs: Můžete změnit barvu pozadí okna
de: Sie können die Hintergrundfarbe des Fensters ändern
es: Puedes cambiar el color de fondo de la ventana
fr: Vous pouvez modifier la couleur d’arrière-plan de la fenêtre
it: Puoi cambiare il colore di sfondo della finestra
pt_br: Você pode mudar a cor de fundo da janela
ru: Вы можете изменить цвет фона окна
tr: Pencere arkaplan rengini değiştirebilirsiniz
zh_cn: 修改窗口背景颜色
zh_tw: 你可以更換視窗背景顏色

source: Incognito Window Background Color
cs: Barva pozadí anonymního okna
de: Inkognito-Fenster Hintergrundfarbe
es: Color de fondo de la ventana de incógnito
fr: Couleur d’arrière-plan de la fenêtre incognito
it: Colore di sfondo della finestra di navigazione in incognito
pt_br: Cor de fundo da janela anônima
ru: Цвет фона окна инкогнито
tr: Gizli Pencere Arkaplan Rengi
zh_cn: 隐私窗口背景色
zh_tw: 無痕模式視窗背景顏色

source: You can change the incognito window background color
cs: Můžete změnit barvu pozadí anonymního okna
de: Sie können die Hintergrundfarbe des Inkognito-Fensters ändern
es: Puedes cambiar el color de fondo de la ventana cuando se ejecuta el modo incógnito
fr: Vous pouvez modifier la couleur d’arrière-plan de la fenêtre incognito
it: Puoi cambiare il colore di sfondo della finestra di navigazione in incognito
pt_br: Você pode mudar a cor de fundo da janela anônima
ru: Вы можете изменить цвет фона окна инкогнито
tr: Gizli pencere arkaplan rengini değiştirebilirsiniz
zh_cn: 修改隐私窗口背景颜色
zh_tw: 你可以更換無痕模式視窗背景顏色

source: Search Bar Font
cs: Písmo vyhledávací lišty
de: Schriftart der Suchleiste
es: Tipo de letra de la barra de búsqueda
fr: Police de la barre de recherche
ko: 검색 창 글꼴
pt_br: Fonte da barra de pesquisa
ru: Шрифт панели поиска
tr: Arama Çubuğu Yazı Tipi
zh_cn: 搜索栏字体
zh_tw: 搜尋欄字體

source: You can change the font of the search bar
cs: Můžete změnit písmo vyhledávání
de: Sie können die Schriftart der Suchleiste ändern
es: Elige la tipografía de la barra de búsqueda
fr: Vous pouvez modifier la police de la barre de recherche
ko: 검색 창의 글꼴을 바꾸기
pt_br: Você pode mudar a fonte da barra de pesquisa
ru: Вы можете изменить шрифт в строке поиска
tr: Arama çubuğu yazı tipini değiştirebilirsiniz
zh_cn: 修改搜索栏字体
zh_tw: 你可以更換搜尋欄的字體

source: Item Title Font
cs: Písmo názvu položky
de: Objekt Titel Schriftart
es: Tipo de letra de los títulos de las notas
fr: Police du titre de l’élément
pt_br: Fonte do título do item
ru: Шрифт заголовка элемента
tr: Öğe Başlığı Yazı Tipi
zh_cn: 项目标题字体
zh_tw: 物件標題字體

source: You can change the font of the title
cs: Můžete změnit písmo nadpisu
de: Sie können die Schriftart des Objekttitels ändern
es: Puedes cambiar la tipografía de los títulos de las notas
fr: Vous pouvez modifier la police du titre
pt_br: Você pode mudar a fonte do título
ru: Вы можете изменить шрифт заголовка
tr: Öğe başlığının yazı tipini değiştirebilirsiniz
zh_cn: 修改项目标题字体
zh_tw: 你可以更換標題的字體

source: Item Date Font
cs: Písmo položky Datum
de: Objekt Datum Schriftart
es: Tipo de letra de la fecha de las notas
fr: Police de la date de l’élément
pt_br: Fonte da data do item
ru: Шрифт даты элемента
zh_cn: 项目日期字体
zh_tw: 物件日期字體

source: You can change the font of the date
cs: Můžete změnit písmo data
de: Sie können die Schriftart des Datums ändern
es: Puedes cambiar la tipografía de la fecha
fr: Vous pouvez modifier la police de la date
pt_br: Você pode mudar a fonte da data
ru: Вы можете изменить шрифт даты
zh_cn: 修改项目日期字体
zh_tw: 你可以更換日期的字體

source: Active Item Border Color
cs: Barva ohraničení aktivní položky
de: Aktiver Eintrag Randfarbe
es: Color del borde de la nota activa
fr: Couleur de bordure de l’élément actif
it: Colore del bordo dell'elemento attivo
pt_br: Cor da borda do item ativo
ru: Цвет границы активного элемента
tr: Etkin Öğe Çerçeve Rengi
zh_cn: 激活项目边框颜色
zh_tw: 選取物件邊界顏色

source: You can change the active item border color
cs: Můžete změnit barvu okraje aktivní položky
de: Sie können die Randfarbe des aktiven Eintrages ändern
es: Elige el color del borde de la nota activa
fr: Vous pouvez modifier la couleur de bordure de l’élément actif
it: È possibile modificare il colore del bordo dell'elemento attivo
pt_br: Você pode mudar a cor da borda do item ativo
ru: Вы можете изменить цвет границы активного элемента
tr: Etkin öğenin çerçeve rengini değiştirebilirsiniz
zh_cn: 修改激活项目的边框颜色
zh_tw: 你可以更換活躍的物件邊界顏色

source: Hovered Item Border Color
cs: Barva ohraničení při najetí na položku
de: Fokusierter Eintrag Randfarbe
es: Color del borde de la nota al pasar el ratón
fr: Couleur de bordure d’un élément survolé
it: Colore del bordo dell'elemento al passaggio del mouse
pt_br: Cor da borda do item destacado
ru: Цвет границы выбранного элемента
tr: Öğenin Üzerine Gelindiğindeki Çerçeve Rengi
zh_cn: 悬停项目边框颜色
zh_tw: 被游標覆蓋物件邊界顏色

source: You can change the hovered item border color
cs: Můžete změnit barvu ohraničení při najetí na položku
de: Sie können die Randfarbe des fokusierter Eintrages ändern
es: Elige el color del borde de las notas al pasar el ratón por encima
fr: Vous pouvez modifier la couleur de bordure d’un élément survolé
it: Puoi cambiare il colore del bordo dell'elemento al passaggio del mouse
pt_br: Você pode mudar a cor da borda do item destacado
ru: Вы можете изменить цвет границы выбранного элемента
tr: Öğenin üzerine geldiğindeki çerçeve rengini değiştirebilirsiniz
zh_cn: 修改鼠标悬停项目的边框颜色
zh_tw: 你可以更換被覆蓋物件邊界顏色

source: Change the style of the emoji item
cs: Změňte styly emoji
de: Ändern des Stils des Emoji-Eintrags
es: Cambia el estilo de las notas de emojis
fr: Changer le style de l’élément émoji
it: Cambia lo stile dell'elemento emoji
pt_br: Mudar o estilo do item de emoji
ru: Изменить стиль элемента с эмодзи
tr: İfadelerin tarzını değiştir
uk: Змінити стиль емодзі
zh_cn: 修改表情符号项目风格
zh_tw: 切換表情符號物件主題

source: Emoji Item Style
cs: Emoji - nastavení stylů
de: Stil Emoji-Eintrag
es: Estilo de las notas de emojis
fr: Style de l’élément émoji
it: Stile oggetto Emoji
ko: 이모티콘 항목 스타일
pt_br: Estilo do item de emoji
ru: Стиль элемента с эмодзи
tr: İfade Öğe Tarzı
uk: Стиль емодзі
zh_cn: 表情符号项目风格
zh_tw: 表情符號物件風格

source: Emoji Size
cs: Velikost emoji
de: Emoji-Größe
es: Tamaño del emoji
fr: Taille d’émoji
it: Dimensione emoji
ko: 이모티콘 크기
pt_br: Tamanho do emoji
ru: Размер эмодзи
tr: İfade Boyutu
uk: Розмір емодзі
zh_cn: 表情符号大小
zh_tw: 表情符號大小

source: You can change the emoji size
cs: Můžete změnit velikost emoji
de: Sie können die Emoji-Größe ändern
es: Puedes cambiar el tamaño de los emoji
fr: Vous pouvez modifier la taille d’émoji
it: Puoi modificare la dimensione dell'emoji
ko: 이모티콘 크기를 바꾸기
pt_br: Você pode mudar o tamanho do emoji
ru: Вы можите изменить размер эмодзи
tr: İfade boyutunu değiştirebilirsiniz
uk: Ви можете змінити розмір емодзі
zh_cn: 修改表情符号大小
zh_tw: 你可以更換表情符號的大小

source: Change the style of the file item
cs: Změňte styly souboru
de: Ändern des Stils des Datei-Eintrags
es: Cambia el estilo de las notas de archivos
fr: Changer le style de l’élément de fichier
it: Cambia lo stile dell'elemento del file
ko: 파일 항목의 스타일을 바꾸기
pt_br: Mudar o estilo do item de arquivo
ru: Изменить стиль элемента с файлом
tr: Dosya öğesinin tarzını değiştir
uk: Змінити стиль елемента файлу
zh_cn: 修改文件项目的风格
zh_tw: 切換檔案物件主題

source: File Item Style
cs: Soubor - nastavení stylů
de: Stil Datei-Eintrag
es: Estilo de las notas de archivos
fr: Style de l’élément fichier
it: Stile elemento file
ko: 파일 항목 스타일
pt_br: Estilo de Item de Arquivo
ru: Стиль элемнта с файлом
tr: Dosya Öğe Tarzı
uk: Стиль елемента файлу
zh_cn: 文件项目风格
zh_tw: 檔案物件風格

source: Body Text Color
cs: Barva textu těla
de: Hauptteil Textfarbe
es: Color del texto del cuerpo
fr: Couleur du texte du corpus
it: Colore del corpo del testo
ko: 내용 텍스트 색상
pt_br: Cor do texto do corpo
ru: Цвет основного текста
tr: Gövde Yazı Rengi
uk: Колір тексту тіла
zh_cn: 正文字体颜色
zh_tw: 內容字體顏色

source: You can change the text color of the body
cs: Můžete změnit barvu textu těla
de: Sie können die Textfarbe des Hauptteils ändern
es: Puedes cambiar el color del texto del cuerpo de la nota
fr: Vous pouvez modifier la couleur du texte du corpus
it: Puoi cambiare il colore del testo del corpo
ko: 내용 텍스트 색상을 바꾸기
pt_br: Você pode mudar a cor do texto do corpo
ru: Вы можете изменить цвет основного текста
tr: Gövdenin yazı rengini değiştirebilirsiniz
uk: Ви можете змінити колір тексту тіла
zh_cn: 修改正文字体颜色
zh_tw: 你可以更換內容的字體顏色

source: Change the style of the image item
cs: Změňte styly obrázku
de: Ändern des Stils des Bild-Eintrags
es: Cambia el estilo de las notas de imagen
fr: Changer le style de l’élément d’image
it: Cambia lo stile dell'elemento immagine
ko: 이미지 항목의 스타일을 바꾸기
pt_br: Mudar o estilo do item de imagem
ru: Изменить стиль элемента с изображением
tr: Resim öğesinin tarzını değiştirebilirsiniz
zh_cn: 修改图像项目风格
zh_tw: 切換圖片物件主題

source: Image Item Style
cs: Obrázek - nastavení stylů
de: Stil Bild-Eintrag
es: Estilo de las notas de imagen
fr: Style de l’élément d’image
it: Stile oggetto immagine
ko: 이미지 항목 스타일
pt_br: Estilo de Item de Imagem
ru: Стиль элемента с изображением
tr: Resim Öğe Tarzı
zh_cn: 图像项目风格
zh_tw: 圖片物件風格

source: Metadata Font
de: Metadaten Schriftart
it: Carattere dei metadati
ko: 메타데이터 글꼴
pt_br: Fonte da metadados
ru: Шрифт метаданных
