{"format": "graph-model", "generatedBy": "2.5.0", "convertedBy": "TensorFlow.js Converter v3.7.0", "signature": {"inputs": {"inputs": {"name": "Placeholder:0", "dtype": "DT_STRING", "tensorShape": {"dim": [{"size": "-1"}]}}}, "outputs": {"classes": {"name": "head/Tile:0", "dtype": "DT_STRING", "tensorShape": {"dim": [{"size": "-1"}, {"size": "54"}]}}, "scores": {"name": "head/predictions/probabilities:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "54"}]}}}}, "modelTopology": {"node": [{"name": "head/ExpandDims/input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {"dim": [{"size": "54"}]}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "head/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "head/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "head/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "head/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "head/Tile/multiples/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/Reshape_1/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/stack/0", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dnn/input_from_feature_columns/input_layer/content_embedding/embedding_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5000"}, {"size": "70"}]}}}}}, {"name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/GreaterEqual/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/GatherV2_2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/to_sparse_input/ignore_value/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/Slice/begin", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/Slice/size", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/GatherV2/indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/SparseFillEmptyRows/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}}}, {"name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/embedding_lookup_sparse/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/embedding_lookup_sparse/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/embedding_lookup_sparse/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "dnn/hiddenlayer_0/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "70"}, {"size": "512"}]}}}}}, {"name": "dnn/hiddenlayer_0/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dnn/hiddenlayer_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dnn/hiddenlayer_1/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "dnn/logits/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "54"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dnn/logits/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "54"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Slice_1/begin", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Slice_1/size", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Reshape_1/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/stack/0", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "linear/linear_model/content/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5000"}, {"size": "54"}]}}}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/GatherV2_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/GreaterEqual/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/GatherV2_2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Slice/begin", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Slice/size", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/to_sparse_input/ignore_value/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "map/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "map/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "map/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "map/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "map/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "map/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Placeholder", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_STRING"}}}, {"name": "map/TensorArrayUnstack/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}}}, {"name": "map/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/Cast/x/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/GatherV2/indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/SparseFillEmptyRows/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/embedding_lookup_sparse/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/embedding_lookup_sparse/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/embedding_lookup_sparse/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Slice_2/begin", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Slice_2/size", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "linear/linear_model/bias_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "54"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "head/ExpandDims", "op": "ExpandDims", "input": ["head/ExpandDims/input", "head/ExpandDims/dim"], "attr": {"T": {"type": "DT_STRING"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "map/Shape", "op": "Shape", "input": ["Placeholder"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_STRING"}}}, {"name": "map/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["Placeholder", "map/TensorArrayUnstack/Const"], "attr": {"element_dtype": {"type": "DT_STRING"}, "shape_type": {"type": "DT_INT32"}}}, {"name": "map/strided_slice", "op": "StridedSlice", "input": ["map/Shape", "map/strided_slice/stack", "map/strided_slice/stack_1", "map/strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "map/TensorArrayV2_1", "op": "TensorListReserve", "input": ["map/TensorArrayV2_1/element_shape", "map/strided_slice"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_STRING"}}}, {"name": "map/while", "op": "StatelessWhile", "input": ["map/while/loop_counter", "map/strided_slice", "map/Const", "map/TensorArrayV2_1", "map/strided_slice", "map/TensorArrayUnstack/TensorListFromTensor"], "attr": {"body": {"func": {"name": "map_while_body_49115"}}, "parallel_iterations": {"i": "10"}, "_read_only_resource_inputs": {"list": {}}, "output_shapes": {"list": {"shape": [{}, {}, {}, {}, {}, {}]}}, "cond": {"func": {"name": "map_while_cond_49114"}}, "_num_original_outputs": {"i": "6"}, "T": {"list": {"type": ["DT_INT32", "DT_INT32", "DT_INT32", "DT_VARIANT", "DT_INT32", "DT_VARIANT"]}}, "_lower_using_switch_merge": {"b": true}}}, {"name": "map/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["map/while:3", "map/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "-1"}, "element_dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/to_sparse_input/NotEqual", "op": "NotEqual", "input": ["map/TensorArrayV2Stack/TensorListStack", "dnn/input_from_feature_columns/input_layer/content_embedding_1/to_sparse_input/ignore_value/x"], "attr": {"T": {"type": "DT_STRING"}, "incompatible_shape_error": {"b": true}}}, {"name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/to_sparse_input/dense_shape", "op": "Shape", "input": ["map/TensorArrayV2Stack/TensorListStack"], "attr": {"T": {"type": "DT_STRING"}, "out_type": {"type": "DT_INT64"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/to_sparse_input/NotEqual", "op": "NotEqual", "input": ["map/TensorArrayV2Stack/TensorListStack", "linear/linear_model/linear/linear_model/linear/linear_model/content/to_sparse_input/ignore_value/x"], "attr": {"T": {"type": "DT_STRING"}, "incompatible_shape_error": {"b": true}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/to_sparse_input/dense_shape", "op": "Shape", "input": ["map/TensorArrayV2Stack/TensorListStack"], "attr": {"T": {"type": "DT_STRING"}, "out_type": {"type": "DT_INT64"}}}, {"name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/to_sparse_input/indices", "op": "Where", "input": ["dnn/input_from_feature_columns/input_layer/content_embedding_1/to_sparse_input/NotEqual"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/Slice", "op": "Slice", "input": ["dnn/input_from_feature_columns/input_layer/content_embedding_1/to_sparse_input/dense_shape", "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/Slice/begin", "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/Slice/size"], "attr": {"T": {"type": "DT_INT64"}, "Index": {"type": "DT_INT32"}}}, {"name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/GatherV2", "op": "GatherV2", "input": ["dnn/input_from_feature_columns/input_layer/content_embedding_1/to_sparse_input/dense_shape", "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/GatherV2/indices", "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/GatherV2/axis"], "attr": {"batch_dims": {"i": "0"}, "Tparams": {"type": "DT_INT64"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/to_sparse_input/indices", "op": "Where", "input": ["linear/linear_model/linear/linear_model/linear/linear_model/content/to_sparse_input/NotEqual"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/Shape/Cast", "op": "Cast", "input": ["linear/linear_model/linear/linear_model/linear/linear_model/content/to_sparse_input/dense_shape"], "attr": {"DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}, "SrcT": {"type": "DT_INT64"}}}, {"name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/to_sparse_input/values", "op": "GatherNd", "input": ["map/TensorArrayV2Stack/TensorListStack", "dnn/input_from_feature_columns/input_layer/content_embedding_1/to_sparse_input/indices"], "attr": {"Tindices": {"type": "DT_INT64"}, "Tparams": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/Prod", "op": "Prod", "input": ["dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/Slice", "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/Const"], "attr": {"T": {"type": "DT_INT64"}, "keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/to_sparse_input/values", "op": "GatherNd", "input": ["map/TensorArrayV2Stack/TensorListStack", "linear/linear_model/linear/linear_model/linear/linear_model/content/to_sparse_input/indices"], "attr": {"Tindices": {"type": "DT_INT64"}, "Tparams": {"type": "DT_STRING"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/strided_slice", "op": "StridedSlice", "input": ["linear/linear_model/linear/linear_model/linear/linear_model/content/Shape/Cast", "linear/linear_model/linear/linear_model/linear/linear_model/content/strided_slice/stack", "linear/linear_model/linear/linear_model/linear/linear_model/content/strided_slice/stack_1", "linear/linear_model/linear/linear_model/linear/linear_model/content/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}}}, {"name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/lookup", "op": "StringToHashBucketFast", "input": ["dnn/input_from_feature_columns/input_layer/content_embedding_1/to_sparse_input/values"], "attr": {"num_buckets": {"i": "5000"}}}, {"name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/Cast/x", "op": "Pack", "input": ["dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/Prod", "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/GatherV2"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT64"}, "N": {"i": "2"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/lookup", "op": "StringToHashBucketFast", "input": ["linear/linear_model/linear/linear_model/linear/linear_model/content/to_sparse_input/values"], "attr": {"num_buckets": {"i": "5000"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/Cast/x", "op": "Pack", "input": ["linear/linear_model/linear/linear_model/linear/linear_model/content/strided_slice", "linear/linear_model/linear/linear_model/linear/linear_model/content/Cast/x/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/GreaterEqual", "op": "GreaterEqual", "input": ["dnn/input_from_feature_columns/input_layer/content_embedding_1/lookup", "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/GreaterEqual/y"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/SparseReshape", "op": "SparseReshape", "input": ["dnn/input_from_feature_columns/input_layer/content_embedding_1/to_sparse_input/indices", "dnn/input_from_feature_columns/input_layer/content_embedding_1/to_sparse_input/dense_shape", "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/Cast/x"]}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/GreaterEqual", "op": "GreaterEqual", "input": ["linear/linear_model/linear/linear_model/linear/linear_model/content/lookup", "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/GreaterEqual/y"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/Cast", "op": "Cast", "input": ["linear/linear_model/linear/linear_model/linear/linear_model/content/Cast/x"], "attr": {"DstT": {"type": "DT_INT64"}, "Truncate": {"b": false}, "SrcT": {"type": "DT_INT32"}}}, {"name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/Where", "op": "Where", "input": ["dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/GreaterEqual"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Where", "op": "Where", "input": ["linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/GreaterEqual"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/SparseReshape", "op": "SparseReshape", "input": ["linear/linear_model/linear/linear_model/linear/linear_model/content/to_sparse_input/indices", "linear/linear_model/linear/linear_model/linear/linear_model/content/to_sparse_input/dense_shape", "linear/linear_model/linear/linear_model/linear/linear_model/content/Cast"]}, {"name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/Reshape", "op": "Reshape", "input": ["dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/Where", "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/Reshape/shape"], "attr": {"T": {"type": "DT_INT64"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Reshape", "op": "Reshape", "input": ["linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Where", "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_INT64"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Cast_1", "op": "Cast", "input": ["linear/linear_model/linear/linear_model/linear/linear_model/content/SparseReshape:1"], "attr": {"SrcT": {"type": "DT_INT64"}, "Truncate": {"b": false}, "DstT": {"type": "DT_INT32"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Slice", "op": "Slice", "input": ["linear/linear_model/linear/linear_model/linear/linear_model/content/SparseReshape:1", "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Slice/begin", "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Slice/size"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT64"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/GatherV2", "op": "GatherV2", "input": ["linear/linear_model/linear/linear_model/linear/linear_model/content/SparseReshape:1", "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/GatherV2/indices", "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/GatherV2/axis"], "attr": {"batch_dims": {"i": "0"}, "Tparams": {"type": "DT_INT64"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}}}, {"name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/GatherV2_1", "op": "GatherV2", "input": ["dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/SparseReshape", "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/Reshape", "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/GatherV2_1/axis"], "attr": {"Tindices": {"type": "DT_INT64"}, "Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tparams": {"type": "DT_INT64"}}}, {"name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/GatherV2_2", "op": "GatherV2", "input": ["dnn/input_from_feature_columns/input_layer/content_embedding_1/lookup", "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/Reshape", "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/GatherV2_2/axis"], "attr": {"Tparams": {"type": "DT_INT64"}, "batch_dims": {"i": "0"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT64"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/GatherV2_2", "op": "GatherV2", "input": ["linear/linear_model/linear/linear_model/linear/linear_model/content/lookup", "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Reshape", "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/GatherV2_2/axis"], "attr": {"Tparams": {"type": "DT_INT64"}, "Tindices": {"type": "DT_INT64"}, "batch_dims": {"i": "0"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Slice_1", "op": "Slice", "input": ["linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Cast_1", "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Slice_1/begin", "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Slice_1/size"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Prod", "op": "Prod", "input": ["linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Slice", "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Const"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_INT64"}}}, {"name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/SparseFillEmptyRows/SparseFillEmptyRows", "op": "SparseFillEmptyRows", "input": ["dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/GatherV2_1", "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/GatherV2_2", "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/SparseReshape:1", "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/SparseFillEmptyRows/Const"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Cast/x", "op": "Pack", "input": ["linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Prod", "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/GatherV2"], "attr": {"axis": {"i": "0"}, "N": {"i": "2"}, "T": {"type": "DT_INT64"}}}, {"name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/embedding_lookup_sparse/strided_slice", "op": "StridedSlice", "input": ["dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/SparseFillEmptyRows/SparseFillEmptyRows", "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/embedding_lookup_sparse/strided_slice/stack", "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/embedding_lookup_sparse/strided_slice/stack_1", "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/embedding_lookup_sparse/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "2"}, "begin_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT64"}}}, {"name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/Reshape_1", "op": "Reshape", "input": ["dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/SparseFillEmptyRows/SparseFillEmptyRows:2", "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/Reshape_1/shape"], "attr": {"T": {"type": "DT_BOOL"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/SparseReshape", "op": "SparseReshape", "input": ["linear/linear_model/linear/linear_model/linear/linear_model/content/SparseReshape", "linear/linear_model/linear/linear_model/linear/linear_model/content/SparseReshape:1", "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Cast/x"]}, {"name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/embedding_lookup_sparse", "op": "SparseSegmentMean", "input": ["dnn/input_from_feature_columns/input_layer/content_embedding/embedding_weights", "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/SparseFillEmptyRows/SparseFillEmptyRows:1", "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/embedding_lookup_sparse/strided_slice"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT64"}, "Tsegmentids": {"type": "DT_INT64"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/GatherV2_1", "op": "GatherV2", "input": ["linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/SparseReshape", "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Reshape", "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/GatherV2_1/axis"], "attr": {"Tparams": {"type": "DT_INT64"}, "Tindices": {"type": "DT_INT64"}, "Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/Shape", "op": "Shape", "input": ["dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/embedding_lookup_sparse"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/zeros_like", "op": "ZerosLike", "input": ["dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/embedding_lookup_sparse"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/SparseFillEmptyRows/SparseFillEmptyRows", "op": "SparseFillEmptyRows", "input": ["linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/GatherV2_1", "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/GatherV2_2", "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/SparseReshape:1", "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/SparseFillEmptyRows/Const"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/strided_slice", "op": "StridedSlice", "input": ["dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/Shape", "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/strided_slice/stack", "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/strided_slice/stack_1", "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/strided_slice/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Reshape_1", "op": "Reshape", "input": ["linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/SparseFillEmptyRows/SparseFillEmptyRows:2", "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Reshape_1/shape"], "attr": {"T": {"type": "DT_BOOL"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/embedding_lookup_sparse/strided_slice", "op": "StridedSlice", "input": ["linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/SparseFillEmptyRows/SparseFillEmptyRows", "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/embedding_lookup_sparse/strided_slice/stack", "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/embedding_lookup_sparse/strided_slice/stack_1", "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/embedding_lookup_sparse/strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "end_mask": {"i": "1"}, "shrink_axis_mask": {"i": "2"}, "T": {"type": "DT_INT64"}}}, {"name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/stack", "op": "Pack", "input": ["dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/stack/0", "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/strided_slice"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/embedding_lookup_sparse", "op": "SparseSegmentSum", "input": ["linear/linear_model/content/weights", "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/SparseFillEmptyRows/SparseFillEmptyRows:1", "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/embedding_lookup_sparse/strided_slice"], "attr": {"Tidx": {"type": "DT_INT64"}, "Tsegmentids": {"type": "DT_INT64"}, "T": {"type": "DT_FLOAT"}}}, {"name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/Tile", "op": "Tile", "input": ["dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/Reshape_1", "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/stack"], "attr": {"Tmultiples": {"type": "DT_INT32"}, "T": {"type": "DT_BOOL"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Shape", "op": "Shape", "input": ["linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/embedding_lookup_sparse"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/zeros_like", "op": "ZerosLike", "input": ["linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/embedding_lookup_sparse"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights", "op": "Select", "input": ["dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/Tile", "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/zeros_like", "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/embedding_lookup_sparse"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/strided_slice", "op": "StridedSlice", "input": ["linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Shape", "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/strided_slice/stack", "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/strided_slice/stack_1", "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "dnn/hiddenlayer_0/Relu", "op": "_FusedMatMul", "input": ["dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights", "dnn/hiddenlayer_0/kernel", "dnn/hiddenlayer_0/bias"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/stack", "op": "Pack", "input": ["linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/stack/0", "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/strided_slice"], "attr": {"axis": {"i": "0"}, "N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "dnn/hiddenlayer_1/Relu", "op": "_FusedMatMul", "input": ["dnn/hiddenlayer_0/Relu", "dnn/hiddenlayer_1/kernel", "dnn/hiddenlayer_1/bias"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Tile", "op": "Tile", "input": ["linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Reshape_1", "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/stack"], "attr": {"Tmultiples": {"type": "DT_INT32"}, "T": {"type": "DT_BOOL"}}}, {"name": "dnn/logits/BiasAdd", "op": "_FusedMatMul", "input": ["dnn/hiddenlayer_1/Relu", "dnn/logits/kernel", "dnn/logits/bias"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "num_args": {"i": "1"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum", "op": "Select", "input": ["linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Tile", "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/zeros_like", "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/embedding_lookup_sparse"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Shape_1", "op": "Shape", "input": ["linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Slice_2", "op": "Slice", "input": ["linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Shape_1", "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Slice_2/begin", "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Slice_2/size"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/concat", "op": "ConcatV2", "input": ["linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Slice_1", "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Slice_2", "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/concat/axis"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Reshape_2", "op": "Reshape", "input": ["linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum", "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "linear/linear_model/linear/linear_model/linear/linear_model/weighted_sum", "op": "BiasAdd", "input": ["linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Reshape_2", "linear/linear_model/bias_weights"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "add", "op": "AddV2", "input": ["dnn/logits/BiasAdd", "linear/linear_model/linear/linear_model/linear/linear_model/weighted_sum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "head/predictions/probabilities", "op": "Softmax", "input": ["add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "head/Shape", "op": "Shape", "input": ["head/predictions/probabilities"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "head/strided_slice", "op": "StridedSlice", "input": ["head/Shape", "head/strided_slice/stack", "head/strided_slice/stack_1", "head/strided_slice/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}}}, {"name": "head/Tile/multiples", "op": "Pack", "input": ["head/strided_slice", "head/Tile/multiples/1"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "head/Tile", "op": "Tile", "input": ["head/ExpandDims", "head/Tile/multiples"], "attr": {"T": {"type": "DT_STRING"}, "Tmultiples": {"type": "DT_INT32"}}}], "library": {"function": [{"signature": {"name": "map_while_body_49115", "inputArg": [{"name": "map_while_loop_counter", "type": "DT_INT32"}, {"name": "map_strided_slice_0", "type": "DT_INT32"}, {"name": "placeholder", "type": "DT_INT32"}, {"name": "placeholder_1", "type": "DT_VARIANT"}, {"name": "map_strided_slice_1_0", "type": "DT_INT32"}, {"name": "tensorarrayv2read_tensorlistgetitem_map_tensorarrayunstack_tensorlistfromtensor_0", "type": "DT_VARIANT"}], "outputArg": [{"name": "add_1", "type": "DT_INT32"}, {"name": "map_strided_slice", "type": "DT_INT32"}, {"name": "add", "type": "DT_INT32"}, {"name": "tensorarrayv2write_tensorlistsetitem", "type": "DT_VARIANT"}, {"name": "map_strided_slice_1", "type": "DT_INT32"}, {"name": "tensorarrayv2read_tensorlistgetitem_map_tensorarrayunstack_tensorlistfromtensor", "type": "DT_VARIANT"}]}, "nodeDef": [{"name": "map_while_body_49115/add_1/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_output_shapes": {"list": {"shape": [{}]}}}}, {"name": "map_while_body_49115/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "_output_shapes": {"list": {"shape": [{}]}}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "map_while_body_49115/StringNGrams/RaggedGetItem/strided_slice/stack", "op": "Const", "attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "1"}]}]}}, "dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "map_while_body_49115/StringNGrams/RaggedGetItem/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "_output_shapes": {"list": {"shape": [{"dim": [{"size": "1"}]}]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "map_while_body_49115/StringNGrams/RaggedGetItem/strided_slice/stack_2", "op": "Const", "attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "1"}]}]}}, "dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "map_while_body_49115/StringNGrams/RaggedGetItem/strided_slice_2/stack", "op": "Const", 